var bubblechartdata = [
    [{"name":"Міністерство соціальної політики України", "size":293402945700, "sizeone":291420009100,"group":1},
    {"name":"Міністерство фінансів України (загальнодержавні видатки та кредитування)", "size":166697591800, "sizeone":170419401900,"group":1},
    {"name":"Міністерство оборони України", "size":117509257800, "sizeone":102556992700,"group":1},
    {"name":"Міністерство охорони здоров'я України", "size":98183290500, "sizeone":93014020500,"group":1},
    {"name":"Міністерство внутрішніх справ України", "size":92966443800, "sizeone":83826785100,"group":1},
    {"name":"Міністерство освіти і науки України (загальнодержавні видатки та кредитування)", "size":86971323800, "sizeone":79559114000,"group":1},
    {"name":"Державне агентство автомобільних доріг України", "size":44793546800, "sizeone":44602407200,"group":5},
    {"name":"Міністерство освіти і науки України", "size":44511528700, "sizeone":43892139800,"group":1},
    {"name":"Рада національної безпеки і оборони України", "size":211751200, "sizeone":28163846600,"group":2},
    {"name":"Міністерство розвитку економіки, торгівлі та сільського господарства України", "size":17949111400, "sizeone":22386885900,"group":1},
    {"name":"Державне агентство автомобільних доріг України (загальнодержавні видатки та кредитування)", "size":22172967200, "sizeone":22171447400,"group":5},
    {"name":"Міністерство фінансів України", "size":18886698700, "sizeone":18562552000,"group":1},
    {"name":"Міністерство охорони здоров'я України (загальнодержавні видатки та кредитування)", "size":17695824200, "sizeone":17704273700,"group":1},
    {"name":"Міністерство юстиції України", "size":14341937500, "sizeone":14644719000,"group":1},
    {"name":"Державна судова адміністрація України", "size":14622144800, "sizeone":14622144800,"group":3},
    {"name":"Міністерство енергетики та захисту довкілля України", "size":16096553500, "sizeone":13538032400,"group":1},
    {"name":"Міністерство розвитку громад та територій України (загальнодержавні видатки та кредитування)", "size":12875000000, "sizeone":13012499500,"group":1},
    {"name":"Міністерство культури, молоді та спорту України", "size":15084733100, "sizeone":12099340900,"group":1},
    {"name":"Служба безпеки України", "size":12165891900, "sizeone":9663684700,"group":2},
    {"name":"Генеральна прокуратура України", "size":7670648200, "sizeone":7670648200,"group":2},
    {"name":"Національна академія наук України", "size":5007566100, "sizeone":5007566100,"group":6},
    {"name":"Міністерство закордонних справ України", "size":4682680300, "sizeone":4716947800,"group":1},
    {"name":"Міністерство інфраструктури України", "size":4954782100, "sizeone":3987265100,"group":1},
    {"name":"Національна академія медичних наук України", "size":3269336700, "sizeone":3103016400,"group":6},
    {"name":"Адміністрація Державної служби спеціального зв'язку та захисту інформації України", "size":2898959400, "sizeone":2927922500,"group":2},
    {"name":"Головне управління розвідки Міністерства оборони України", "size":3571682800, "sizeone":2860483200,"group":2},
    {"name":"Міністерство розвитку громад та територій України", "size":2484771700, "sizeone":2793896100,"group":1},
    {"name":"Державне управління справами", "size":2412781200, "sizeone":2476218100,"group":7},
    {"name":"Міністерство розвитку економіки, торгівлі та сільського господарства України (загальнодержавні видатки та кредитування)", "size":78450700, "sizeone":2417883300,"group":1},
    {"name":"Верховний Суд", "size":2383063400, "sizeone":2383063400,"group":3},
    {"name":"Центральна виборча комісія (загальнодержавні видатки та кредитування)", "size":2154988000, "sizeone":2154988000,"group":7},
    {"name":"Державний комітет телебачення і радіомовлення України", "size":2095616600, "sizeone":2105904700,"group":7},
    {"name":"Служба зовнішньої розвідки України", "size":2364767700, "sizeone":2025449400,"group":2},
    {"name":"Апарат Верховної Ради України", "size":2007430700, "sizeone":1973395700,"group":7},
    {"name":"Державне бюро розслідувань", "size":1902748100, "sizeone":1902748100,"group":2},
    {"name":"Господарсько-фінансовий департамент Секретаріату Кабінету Міністрів України", "size":3608716200, "sizeone":1777805200,"group":1},
    {"name":"Міністерство соціальної політики України (загальнодержавні видатки та кредитування)", "size":795384300, "sizeone":1768983600,"group":1},
    {"name":"Управління державної охорони України", "size":1583045400, "sizeone":1343135800,"group":2},
    {"name":"Національна академія аграрних наук України", "size":1306506400, "sizeone":1306506400,"group":6},
    {"name":"Міністерство у справах ветеранів, тимчасово окупованих територій та внутрішньо переміщених осіб України (загальнодержавні видатки та кредитування)", "size":1266216700, "sizeone":1238590300,"group":1},
    {"name":"Господарсько-фінансовий департамент Секретаріату Кабінету Міністрів України (загальнодержавні видатки та кредитування)", "size":1060740500, "sizeone":1214984100,"group":1},
    {"name":"Національне антикорупційне бюро України", "size":1038178100, "sizeone":1038178100,"group":2},
    {"name":"Центральна виборча комісія", "size":833649200, "sizeone":874352200,"group":7},
    {"name":"Національне агентство з питань запобігання корупції", "size":689283100, "sizeone":812064800,"group":2},
    {"name":"Державне космічне агентство України", "size":667063300, "sizeone":670515300,"group":5},
    {"name":"Національна комісія, що здійснює державне регулювання у сферах енергетики та комунальних послуг", "size":487522500, "sizeone":487522500,"group":7},
    {"name":"Фонд державного майна України", "size":767620300, "sizeone":467620300,"group":7},
    {"name":"Міністерство у справах ветеранів, тимчасово окупованих територій та внутрішньо переміщених осіб України", "size":534081700, "sizeone":424223900,"group":1},
    {"name":"Дніпропетровська обласна державна адміністрація", "size":397779000, "sizeone":397779000,"group":4},
    {"name":"Харківська обласна державна адміністрація", "size":396014500, "sizeone":396014500,"group":4},
    {"name":"Вищий антикорупційний суд", "size":373648400, "sizeone":373648400,"group":3},
    {"name":"Рахункова палата", "size":372515300, "sizeone":372515300,"group":7},
    {"name":"Київська обласна державна адміністрація", "size":370621400, "sizeone":370621400,"group":4},
    {"name":"Донецька обласна державна адміністрація", "size":363052900, "sizeone":363052900,"group":4},
    {"name":"Вінницька обласна державна адміністрація", "size":353024100, "sizeone":353024100,"group":4},
    {"name":"Одеська обласна державна адміністрація", "size":345488600, "sizeone":345488600,"group":4},
    {"name":"Львівська обласна державна адміністрація", "size":334789800, "sizeone":334789800,"group":4},
    {"name":"Житомирська обласна державна адміністрація", "size":312355400, "sizeone":312355400,"group":4},
    {"name":"Полтавська обласна державна адміністрація", "size":307943000, "sizeone":307943000,"group":4},
    {"name":"Чернігівська обласна державна адміністрація", "size":305955700, "sizeone":305955700,"group":4},
    {"name":"Запорізька обласна державна адміністрація", "size":293567300, "sizeone":293567300,"group":4},
    {"name":"Луганська обласна державна адміністрація", "size":278956500, "sizeone":278956500,"group":4},
    {"name":"Національне агентство України з питань виявлення, розшуку та управління активами, одержаними від корупційних та інших злочинів", "size":275614700, "sizeone":278614700,"group":5},
    {"name":"Кіровоградська обласна державна адміністрація", "size":271138300, "sizeone":271138300,"group":4},
    {"name":"Хмельницька обласна державна адміністрація", "size":265590800, "sizeone":265590800,"group":4},
    {"name":"Черкаська обласна державна адміністрація", "size":265297500, "sizeone":265297500,"group":4},
    {"name":"Івано-Франківська обласна державна адміністрація", "size":264802900, "sizeone":264802900,"group":4},
    {"name":"Конституційний Суд України", "size":257808900, "sizeone":257808900,"group":3},
    {"name":"Тернопільська обласна державна адміністрація", "size":255915800, "sizeone":255915800,"group":4},
    {"name":"Сумська обласна державна адміністрація", "size":254108900, "sizeone":254108900,"group":4},
    {"name":"Миколаївська обласна державна адміністрація", "size":251294300, "sizeone":251294300,"group":4},
    {"name":"Національна академія педагогічних наук України", "size":243569700, "sizeone":243569700,"group":6},
    {"name":"Рівненська обласна державна адміністрація", "size":241216700, "sizeone":241216700,"group":4},
    {"name":"Закарпатська обласна державна адміністрація", "size":237504100, "sizeone":237504100,"group":4},
    {"name":"Волинська обласна державна адміністрація", "size":236258600, "sizeone":236258600,"group":4},
    {"name":"Херсонська обласна державна адміністрація", "size":234551300, "sizeone":234551300,"group":4},
    {"name":"Вища рада правосуддя", "size":234101400, "sizeone":234101400,"group":3},
    {"name":"Антимонопольний комітет України", "size":221975500, "sizeone":221975500,"group":7},
    {"name":"Національне агентство України з питань державної служби", "size":207649300, "sizeone":215855300,"group":5},
    {"name":"Чернівецька обласна державна адміністрація", "size":190343000, "sizeone":190343000,"group":4},
    {"name":"Секретаріат Уповноваженого Верховної Ради України з прав людини", "size":153894400, "sizeone":144745000,"group":7},
    {"name":"Національна комісія з цінних паперів та фондового ринку", "size":129919100, "sizeone":129919100,"group":7},
    {"name":"Міністерство цифрової трансформації України", "size":153541900, "sizeone":120638900,"group":1},
    {"name":"Національна комісія, що здійснює державне регулювання у сфері зв'язку та інформатизації", "size":91266000, "sizeone":91266000,"group":7},
    {"name":"Національна комісія, що здійснює державне регулювання у сфері ринків фінансових послуг", "size":80782600, "sizeone":80782600,"group":7},
    {"name":"Державна інспекція ядерного регулювання України", "size":80503700, "sizeone":80503700,"group":7},
    {"name":"Державна регуляторна служба України", "size":67468700, "sizeone":74837400,"group":7},
    {"name":"Міністерство цифрової трансформації України  (загальнодержавні видатки та кредитування)", "size":73580000, "sizeone":73580000,"group":1},
    {"name":"Національна рада України з питань телебачення і радіомовлення", "size":66181900, "sizeone":66181900,"group":7},
    {"name":"Національна академія правових наук України", "size":73896800, "sizeone":54939800,"group":6},
    {"name":"Національна академія мистецтв України", "size":35770800, "sizeone":35770800,"group":6},
    {"name":"Вищий суд з питань інтелектуальної власності", "size":31547300, "sizeone":31547300,"group":3}],
    
    [{"name":"Податки на доходи, податки на прибуток, податки на збільшення ринкової вартості", "size":248264365100, "sizeone":239270350500,"group":1},
    {"name":"Рентна плата та плата за використання інших природних ресурсів", "size":55334926000, "sizeone":58148627700,"group":1},
    {"name":"Внутрішні податки на товари та послуги", "size":587251000000, "sizeone":591946000000,"group":1},
    {"name":"Податки на міжнародну торгівлю та зовнішні операції", "size":32175000000, "sizeone":32864000000,"group":1},
    {"name":"Інші податки та збори", "size":3523965500, "sizeone":3523965500,"group":1},
    {"name":"Доходи від власності та підприємницької діяльності", "size":86327601900, "sizeone":77446525900,"group":2},
    {"name":"Адміністративні збори та платежі, доходи від некомерційної господарської діяльності", "size":15662238000, "sizeone":9892231600,"group":2},
    {"name":"Інші неподаткові надходження", "size":16402318600, "sizeone":17338294200,"group":2},
    {"name":"Власні надходження бюджетних установ ", "size":36395059800, "sizeone":36398059800,"group":2},
    {"name":"Надходження від продажу основного капіталу", "size":31106000, "sizeone":31106000,"group":2},
    {"name":"Надходження від реалізації державних запасів товарів", "size":607853000, "sizeone":607853000,"group":2},
    {"name":"Кошти від продажу землі і нематеріальних активів", "size":7184800, "sizeone":7184800,"group":2},
    {"name":"Від Європейського Союзу, урядів іноземних держав, міжнародних організацій, донорських установ", "size":2733593500, "sizeone":3062220400,"group":2},
    {"name":"Цільові фонди", "size":189478200, "sizeone":189478200,"group":2}]
    ]
        function bubbleChart (json, divid, w) {
            
            if (w < 600) {
                var width = window.innerWidth-10
                var height = 800
            } else {
                var width = 600
                var height = 450
            }
            d3.select("#"+divid).html('')
            var svg = d3.select("#"+divid)
                .append("svg")
                .attr("width", width)
                .attr("height", height);
    
            var dataset = json;
            if (divid == 'expences') {
                var domain = [1, 2, 3, 4,5,6,7];
                var scale = [100, 450, 550, 650,750,850,950];
                var colors = ["#006064", "#f9a825", "#ad1457", '#512da8', "#1976d2", "#0097a7", '#e57373']
                var minmax= [31547300, 29142000910]
                //var xCenter = [200, 420, 490, 560, 630, 700,770]
                var xCenter = [110, 240, 290, 350, 410, 470,530]
    
                svg.append("circle").attr("cx",10).attr("cy",14).attr("r", 6).style("fill", "#006064")
                svg.append("circle").attr("cx",10).attr("cy",30).attr("r", 6).style("fill", "#f9a825")
                svg.append("circle").attr("cx",10).attr("cy",46).attr("r", 6).style("fill", "#ad1457")
                svg.append("circle").attr("cx",10).attr("cy",61).attr("r", 6).style("fill", "#512da8")
                svg.append("circle").attr("cx",140).attr("cy",14).attr("r", 6).style("fill", "#1976d2")
                svg.append("circle").attr("cx",140).attr("cy",30).attr("r", 6).style("fill", "#0097a7")
                svg.append("circle").attr("cx",140).attr("cy",46).attr("r", 6).style("fill", "#e57373")
    
                svg.append("text").attr("x", 20).attr("y", 19).text("Министерства").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 20).attr("y", 35).text("Силовики").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 20).attr("y", 51).text("Суд").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 20).attr("y", 67).text("ОГА").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 150).attr("y", 19).text("Агентства").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 150).attr("y", 35).text("Академии").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 150).attr("y", 51).text("Другое").style("font-size", "14px").attr("alignment-baseline","left")
            } else {
                var domain = [1, 2]
                var scale = [110, 200];
                var colors = ["#006064", "#f9a825"]
                var minmax = [7184800,58725100000]
                var xCenter = [200, 460]
                svg.append("circle").attr("cx",10).attr("cy",14).attr("r", 6).style("fill", "#006064")
                svg.append("circle").attr("cx",10).attr("cy",30).attr("r", 6).style("fill", "#f9a825")
                svg.append("text").attr("x", 20).attr("y", 19).text("Налоговые доходы").style("font-size", "14px").attr("alignment-baseline","left")
                svg.append("text").attr("x", 20).attr("y", 35).text("Неналоговые доходы").style("font-size", "14px").attr("alignment-baseline","left")
            }
            
            var x = d3.scaleOrdinal()
                .domain(domain)
                .range(scale)
            
            var color = d3.scaleOrdinal()
              .domain(domain)
              .range(colors);
            
            var size = d3.scaleLinear()
                .domain(minmax)
                .range([5,10]) 
    
            
            var node = svg.append("g")
                .selectAll("circle")
                .data(dataset)
                .enter()
                .append("circle")
                .attr('r', function(d) { return size(d.size);})
                .attr("cx", width / 4)
                .attr("cy", height / 4)
                .style("fill", function(d){ return color(d.group)})
                .style("fill-opacity", 0.8)
                .attr("stroke", "black")
                .style("stroke-width", 2);
    
            var tooltip = d3.select("body")
                .append("div")
                .style("position", "absolute")
                .style("z-index", "10")
                .style("visibility", "hidden")
                .style("padding", "14px")
                .style("background-color", "#f5f5f5")
                .style("color", "black")
                .style("border-radius", "6px")
                .style("border-color", "black")
                .style("font", "12px sans-serif")
                .text("tooltip");
            
            node
                .on("mouseover", function(d) {
                    var change = (d.size - d.sizeone)/d.sizeone
                    var size = d.size/1000000000
                    if (change > 0) {
                        var color = 'green'
                    } else if (change == 0) {
                        var color = 'grey'
                    } else {
                        var color = 'red'
                    }
                    tooltip.html("<h3>"+d.name + "</h3>"+
                        '<p>Бюджет во 2 чтении: '+ size.toFixed(2) + ' млрд</p>'+
                        '<p>Изменения с 1 чтения: <b style="color:'+color+'">'+ change.toFixed(2) + '%</b></p>'
                        )
                    tooltip.style("visibility", "visible");
                })
                .on("mousemove", function() {
                    return tooltip.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
                })
                .on("mouseout", function(){return tooltip.style("visibility", "hidden");});
    
            var simulation = d3.forceSimulation(dataset)
                .force('charge', d3.forceManyBody().strength(.1))
                .force('x', d3.forceX().x(function(d) {return xCenter[d.group-1];}))
                .force("y", d3.forceY().strength(0.1).y(function (d) {
                    if (window.innerWidth < 600) {
                        return height / 5.2
                    } else {
                        return height / 2 
                    }
                }))
                .force('collision', d3.forceCollide().radius(function(d) {
                    return size(d.size);
                }));
    
            simulation
                .nodes(dataset)
                .on("tick", function(d){
                    node
                        .attr("cx", function(d){ 
                            if (window.innerWidth < 600) {
                                return d.y; 
                            } else {
                                return d.x; 
                            }
                        })
                        .attr("cy", function(d){ 
                            if (window.innerWidth < 600) {
                                return d.x+70; 
                            } else {
                                return d.y; 
                            }
                        });
                    });
        }
    
        var beedata = [
            [
        {"id": "Внески до міжнародних організацій","value": 11900,"size": "119000000","group": "1","index": 0,"x": 879.9499650102892,"y": 101.7829825704364,"vy": 0.000004974489446083461,"vx": -2.4758654829187878e-8}, 
        {"id": "Прискорення інвестицій у сільське господарство України","value": 11900,"size": "595000000","group": "1","index": 1,"x": 879.9499622599737,"y": 117.94083714505828,"vy": 0.0000049744894474128014,"vx": -2.346593273122517e-8}, 
        {"id": "Субвенція з державного бюджету місцевим бюджетам на реалізацію проекту Житло для внутрішньо-переміщених осіб","value": 4750,"size": "475000000","group": "1","index": 2,"x": 805.9448897750977,"y": 109.96295245508381,"vy": 0.000005750190031631524,"vx": -3.2142923612163454e-8}, 
        {"id": "Субвенція з державного бюджету міському бюджету міста Харкова на подовження третьої лінії метрополітену у м. Харкові","value": 1083.25,"size": "326188000","group": "1","index": 3,"x": 687.9473188682474,"y": 110.00141137305505,"vy": 0.000002991418511371713,"vx": 0.00004042888506007817}, 
        {"id": "Гранти Президента України молодим діячам мистецтва для створення і реалізації творчих проектів в сфері кінематографії та премії за видатні досягнення у галузі кінематографії","value": 876.19,"size": "3680000","group": "1","index": 4,"x": 671.877507306914,"y": 109.96363411097926,"vy": 0.000004990612445453885,"vx": -0.000031133349448122763}, 
        {"id": "Центральна виборча комісія (загальнодержавні видатки та кредитування)","value": 772.43,"size": "1907977000","group": "7","index": 5,"x": 658.5552829305029,"y": 100.35941419774413,"vy": -0.000007801776259943878,"vx": -0.000004763866882037584}, 
        {"id": "Субвенція з державного бюджету місцевим бюджетам на проведення виборів депутатів місцевих рад та сільських, селищних, міських голів","value": 772.43,"size": "1907977000","group": "7","index": 6,"x": 658.5582492328253,"y": 119.5719690167822,"vy": 0.000017805609920952644,"vx": -0.000004709028506911291}, 
        {"id": "Підготовка і участь національних збірних команд в Паралімпійськихі Дефлімпійських іграх","value": 588.35,"size": "838352000","group": "1","index": 7,"x": 638.4144097989212,"y": 103.77684899654287,"vy": 0.000006046136544335997,"vx": 3.7452184093985164e-8}, 
        {"id": "Загальнодержавні топографо-геодезичні та картографічні роботи, демаркація та делімітація державного кордону","value": 527.24,"size": "26543000","group": "1","index": 8,"x": 628.3956541464042,"y": 116.49612523318869,"vy": 0.000006297946651452548,"vx": 3.571368052601156e-7}, 
        {"id": "Реалізація проекту з розбудови прикордонної дорожньої інфраструктури та облаштування пунктів пропуску","value": 373.48,"size": "78880000","group": "1","index": 9,"x": 612.6431784654321,"y": 124.07454433629515,"vy": -0.0002972292361039084,"vx": 0.00032211230908404075}, 
        {"id": "Державна служба якості освіти","value": 362.52,"size": "115158300","group": "1","index": 10,"x": 600.5381630944868,"y": 63.113661918990054,"vy": 0.000055643266488689455,"vx": 0.0000011991817976091633}, 
        {"id": "Керівництво та управління у сфері забезпечення якості освіти","value": 339.52,"size": "107853600","group": "1","index": 11,"x": 599.9110207130981,"y": 147.87018621702478,"vy": 0.0001451907515017583,"vx": -0.00008452514943532674}, 
        {"id": "Апарат Міністерства соціальної політики України","value": 317.09,"size": "90462669500","group": "1","index": 12,"x": 588.7222408101907,"y": 97.1449065512619,"vy": 0.00007872472011803408,"vx": -0.000022821674386796333}, 
        {"id": "Підтримка пріоритетних напрямів наукових досліджень і науково-технічних (експериментальних) розробок у закладах вищої освіти","value": 300,"size": "300000000","group": "1","index": 13,"x": 598.577172752243,"y": 131.83686737405495,"vy": 0.0000989127465179455,"vx": 0.00005884131960754643}, 
        {"id": "Національна служба здоров’я України","value": 275.35,"size": "53030323100","group": "1","index": 14,"x": 572.761113031031,"y": 142.12398837976787,"vy": 0.000022441110169618627,"vx": 0.000018032768009276085}, 
        {"id": "Керівництво та управління у сфері енергетичного нагляду","value": 269.51,"size": "149881900","group": "1","index": 15,"x": 572.6502401139231,"y": 64.89625187968102,"vy": 0.00002781159714402622,"vx": 0.000005586459965040667}, 
        {"id": "Державна цільова екологічна програма першочергових заходів приведення у безпечний стан об’єктів і майданчика колишнього уранового виробництва виробничого об’єднання Придніпровський хімічний завод на 2019-2023 роки","value": 198.74,"size": "29640900","group": "1","index": 16,"x": 550.5446866594616,"y": 125.53666568628277,"vy": 0.00014173797188529077,"vx": -0.0002288770381881836}, 
        {"id": "Підготовка і участь національних збірних команд України в міжнародних змаганнях, що проводять Міжнародний, Європейський олімпійські комітети, включаючи Олімпійські ігри, та Всесвітніх іграх","value": 189.57,"size": "252922700","group": "1","index": 17,"x": 550.3786895634906,"y": 109.4759401117837,"vy": 0.00011362005273571639,"vx": 0.00017819323219150823}, 
        {"id": "Організаційне, матеріально-технічне, інформаційне та інше забезпечення діяльності Національної ради України з питань розвитку науки і технологій","value": 165.07,"size": "840700","group": "1","index": 18,"x": 536.5907715174862,"y": 117.7006505257452,"vy": -0.00026792554049500164,"vx": -0.00008547170182528312}, 
        {"id": "Розвиток мережі та утримання автомобільних доріг загального користування державного значення","value": 159.92,"size": "23386801900","group": "5","index": 19,"x": 532.2712118568563,"y": 138.416544526122,"vy": -0.000019586409521810467,"vx": 0.00004284986800425312}, 
        {"id": "Міністерство охорони здоров'я України","value": 149.51,"size": "58833214900","group": "1","index": 20,"x": 529.0943000044291,"y": 89.68619119806218,"vy": -0.000719429628598078,"vx": 0.0009503186710032407}, 
        {"id": "Керівництво та управління у сфері запобігання корупції","value": 110.57,"size": "213059500","group": "2","index": 21,"x": 509.2408116217872,"y": 122.96493802330075,"vy": 0.004086246652735007,"vx": 0.0022722532743257905}, 
        {"id": "Керівництво та управління у сфері геологічного вивчення та використання надр","value": 110.57,"size": "61647700","group": "1","index": 22,"x": 506.0020015238532,"y": 107.24548408948026,"vy": 0.0035037523557352947,"vx": 0.0038461720214156008}, 
        {"id": "Модернізація системи соціальної підтримки населення України","value": 105.36,"size": "590016000","group": "1","index": 23,"x": 500.0891293175333,"y": 87.01968393742787,"vy": -0.008449916420220653,"vx": 0.001416097725338849}, 
        {"id": "Фінансова підтримка Національної суспільної телерадіокомпанії України","value": 100.15,"size": "1006515900","group": "1","index": 24,"x": 497.0572198167503,"y": 133.73315009097288,"vy": -0.001468558681451012,"vx": -0.0029292581376432723}, 
        {"id": "Державне агентство інфраструктурних проектів України","value": 98.34,"size": "2071720400","group": "1","index": 25,"x": 493.12454997608677,"y": 117.52605419573871,"vy": -0.00213780561843932,"vx": -0.0004763091243737594}, 
        {"id": "Господарсько-фінансовий департамент Секретаріату Кабінету Міністрів України","value": 96.91,"size": "1776004600","group": "1","index": 26,"x": 490.9456077124581,"y": 100.762038267539,"vy": -0.004326624993909606,"vx": 0.006870847036747858}, 
        {"id": "Керівництво та управління у сфері міграції, громадянства, імміграції та реєстрації фізичних осіб","value": 92.71,"size": "91901000","group": "1","index": 27,"x": 485.9780252075815,"y": 145.60990261533763,"vy": 0.0010932875034523261,"vx": -0.0002076205251678502}, 
        {"id": "Державний комітет телебачення і радіомовлення України","value": 90.88,"size": "997746900","group": "1","index": 28,"x": 485.3635108723563,"y": 79.91050108225137,"vy": -0.005332007632774239,"vx": -0.00007692903394929499}, 
        {"id": "Забезпечення діяльності Державного бюро розслідувань","value": 71.22,"size": "791487000","group": "2","index": 29,"x": 477.6277144374944,"y": 110.56892638294306,"vy": -0.00613286633019788,"vx": 0.004657790370764053}, 
        {"id": "Забезпечення діяльності Державної спеціальної служби транспорту","value": 70.11,"size": "561788700","group": "1","index": 30,"x": 476.16811241437995,"y": 93.40503920539146,"vy": -0.0012245196098079724,"vx": 0.005090316807666441}, 
        {"id": "Витрати Аграрного фонду пов'язані з комплексом заходів іззберігання, перевезення, переробки та експортом об'єктів державного цінового регулювання державного інтервенційного фонду","value": 68.11,"size": "36100000","group": "1","index": 31,"x": 468.2861821975398,"y": 72.05858588013025,"vy": -0.00179994701946246,"vx": -0.0016591979313849605}, 
        {"id": "Утилізація боєприпасів, рідинних компонентів ракетного палива, озброєння, військової техніки та іншого військового майна, забезпечення живучості та вибухопожежобезпеки арсеналів, баз і складів Збройних Сил України","value": 65.55,"size": "1005736600","group": "1","index": 32,"x": 471.7205163210688,"y": 134.086433046924,"vy": -0.004028690468557984,"vx": 0.005578227921780979}, 
        {"id": "Міністерство інфраструктури України","value": 62.42,"size": "1904145600","group": "1","index": 33,"x": 462.7925545546515,"y": 103.1159617231876,"vy": -0.00288863492466358,"vx": 0.00312350795567536}, 
        {"id": "Гідрометеорологічна діяльність","value": 58.52,"size": "240466100","group": "1","index": 34,"x": 464.22702269991663,"y": 119.6467753956846,"vy": -0.0031089585204107538,"vx": 0.005501830176087236}, 
        {"id": "Лікування громадян України за кордоном","value": 57.98,"size": "400000000","group": "1","index": 35,"x": 462.9635003942313,"y": 147.8325614212324,"vy": 0.0016269221175126377,"vx": 0.015298035961616809}, 
        {"id": "Забезпечення двостороннього співробітництва України з іноземними державами та міжнародними організаціями, інформаційне та організаційне забезпечення участі України у міжнародних форумах, конференціях, виставках","value": 56.75,"size": "91730300","group": "1","index": 36,"x": 461.55211313532857,"y": 86.58910545297648,"vy": 0.0010523402565854856,"vx": 0.003759001208306613}, 
        {"id": "Державна служба статистики України","value": 53.26,"size": "883682600","group": "1","index": 37,"x": 455.34163779722974,"y": 133.21165410188686,"vy": -0.0022689649289501916,"vx": 0.004308963727926592}, 
        {"id": "Фінансове забезпечення заходів із забезпечення безпеки дорожнього руху відповідно до державних програм","value": 51.09,"size": "1071109200","group": "1","index": 38,"x": 451.16012793839263,"y": 164.78330007693978,"vy": 0.012223079917719192,"vx": -0.0035001287004624367}, 
        {"id": "Субвенція з державного бюджету місцевим бюджетам на фінансове забезпечення будівництва, реконструкції, ремонту і утримання автомобільних доріг загального користування місцевого значення, вулиць і доріг комунальної власності у населених пунктах","value": 51.09,"size": "7497764400","group": "5","index": 39,"x": 445.2481618281708,"y": 147.90785692008023,"vy": 0.005608337429373723,"vx": 0.01495356997848247}, 
        {"id": "Інформаційно-аналітичне та організаційне забезпечення оперативного реагування органів виконавчої влади","value": 50.95,"size": "38306600","group": "1","index": 40,"x": 439.32263140718305,"y": 130.82154577685768,"vy": -0.0005874937815370288,"vx": 0.0038235115790410954}, 
        {"id": "Державне агентство автомобільних доріг України (загальнодержавні видатки та кредитування)","value": 50.89,"size": "7477764400","group": "5","index": 41,"x": 452.6470621630096,"y": 59.11855336602683,"vy": -0.003207434113500446,"vx": -0.0010160289025258516}, 
        {"id": "Державне агентство автомобільних доріг України (загальнодержавні видатки та кредитування)","value": 50.89,"size": "7477764400","group": "5","index": 42,"x": 447.787778785342,"y": 113.15543856023412,"vy": -0.0005033799040205202,"vx": 0.0038919734455023884}, 
        {"id": "Керівництво та управління у сфері державного майна","value": 49.65,"size": "168993900","group": "7","index": 43,"x": 448.2160772211454,"y": 95.48332577466608,"vy": -0.0006445304246776315,"vx": 0.001895613250511692}, 
        {"id": "Державна підтримка кінематографії","value": 49.18,"size": "250000000","group": "1","index": 44,"x": 436.52750947883976,"y": 51.81214813359009,"vy": -0.0035896461923303215,"vx": -0.001094764149715747}, 
        {"id": "Підтримка впровадження Енергетичної стратегії України","value": 48.97,"size": "242937500","group": "1","index": 45,"x": 433.3016491043209,"y": 101.49984894068453,"vy": -0.00031718537301411617,"vx": 0.0014975604784136698}, 
        {"id": "Державне агентство України з питань кіно","value": 48.82,"size": "254451400","group": "1","index": 46,"x": 449.09929740967476,"y": 76.448809574623,"vy": -0.001554381168184523,"vx": 0.005472338457895089}, 
        {"id": "Здійснення правосуддя Апеляційною палатою Вищого антикорупційного суду","value": 45.07,"size": "34684300","group": "3","index": 47,"x": 435.779878091319,"y": 85.35970127247214,"vy": -0.003024707381860027,"vx": 0.003918302798630595}, 
        {"id": "Національна академія правових наук України","value": 44.83,"size": "22875100","group": "6","index": 48,"x": 435.8133655700759,"y": 178.40266109517634,"vy": -0.005346690562453697,"vx": -0.004037569041050439}, 
        {"id": "Будівництво (придбання) житла для військовослужбовців Збройних Сил України","value": 42.88,"size": "360117100","group": "1","index": 49,"x": 435.41597904956717,"y": 67.89775528975609,"vy": -0.002872633636627189,"vx": 0.006209918762143243}, 
        {"id": "Керівництво та управління у сфері охорони державного кордону України","value": 42.66,"size": "109596700","group": "1","index": 50,"x": 435.07980355391425,"y": 162.391792261988,"vy": -0.005552638689577587,"vx": -0.000995957322504914}, 
        {"id": "Державні премії, стипендії та гранти в галузі освіти, науки і техніки, стипендії переможцям міжнародних конкурсів","value": 39.94,"size": "17962800","group": "1","index": 51,"x": 430.7087795107098,"y": 117.32815966299457,"vy": 0.000005613493581256568,"vx": 0.0021134750373287916}, 
        {"id": "Підвищення кваліфікації педагогічних та науково-педагогічних працівників, керівних працівників і спеціалістів харчової, переробної промисловості та агропромислового комплексу, медичних та фармацевтичних кадрів","value": 39.66,"size": "16274400","group": "1","index": 52,"x": 420.190993345322,"y": 73.00686988101694,"vy": -0.0021370807030184997,"vx": 0.005889969242415133}, 
        {"id": "Керівництво та управління у сфері надзвичайних ситуацій","value": 38.33,"size": "65010500","group": "1","index": 53,"x": 427.67182395659086,"y": 147.18887459708375,"vy": 0.0011747463388492498,"vx": 0.013805631283038832}, 
        {"id": "Здійснення зовнішнього оцінювання та моніторинг якості освіти Українським центром оцінювання якості освіти та його регіональними підрозділами","value": 37.91,"size": "97278400","group": "1","index": 54,"x": 421.3519706299816,"y": 57.09644260896862,"vy": -0.004402682256233443,"vx": -0.0016345563759331716}, 
        {"id": "Апарат Міністерства фінансів України","value": 37.85,"size": "256017800","group": "1","index": 55,"x": 424.32133003443084,"y": 41.29843727950619,"vy": -0.004248272963243622,"vx": -0.0005241365294405949}, 
        {"id": "Виконання зобов'язань України у сфері міжнародного науково-технічного та освітнього співробітництва","value": 36.03,"size": "23042900","group": "1","index": 56,"x": 420.2296921786659,"y": 88.94898734490154,"vy": -0.0007525752607592833,"vx": 0.0037234708942501422}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії правових наук України","value": 35.83,"size": "5566100","group": "6","index": 57,"x": 415.8350183891057,"y": 27.671207711947375,"vy": -0.011678717243772585,"vx": 0.011228145343237982}, 
        {"id": "Керівництво та управління у сфері фінансового моніторингу","value": 35.82,"size": "30853300","group": "1","index": 58,"x": 419.89221450333525,"y": 176.7616420316055,"vy": -0.007971706418261322,"vx": -0.00393232560800312}, 
        {"id": "Мобілізаційна підготовка галузей національної економіки України","value": 35.8,"size": "20680600","group": "1","index": 59,"x": 423.349210200169,"y": 131.46370608864643,"vy": 0.002781019852654991,"vx": 0.0036484243304841513}, 
        {"id": "Адаптація системи управління персоналом державної служби до стандартів ЄС","value": 35.31,"size": "5667600","group": "5","index": 60,"x": 408.9408912439408,"y": 46.95355533438976,"vy": -0.0067214974248763736,"vx": 0.000417561951435388}, 
        {"id": "Державна служба фінансового моніторингу України","value": 34.41,"size": "31667700","group": "1","index": 61,"x": 419.1534136696706,"y": 160.76141637842431,"vy": -0.00801229911869203,"vx": -0.0014750100240308011}, 
        {"id": "Апарат Державного агентства автомобільних доріг України","value": 34.09,"size": "11388897300","group": "5","index": 62,"x": 415.5219971436608,"y": 106.81740848044853,"vy": -0.0008513289035248336,"vx": 0.0008682870659667846}, 
        {"id": "Розвиток, закупівля, модернізація та ремонт озброєння, військової техніки, засобів та обладнання","value": 33.98,"size": "5765569900","group": "1","index": 63,"x": 410.8883024911428,"y": 143.3198295388166,"vy": 0.012090691008552897,"vx": 0.010082460075354365}, 
        {"id": "Щоквартальна плата домогосподарствам за ведення записів доходів, витрат та інших відомостей під час проведення обстеження умов їх життя","value": 33.01,"size": "1815100","group": "1","index": 64,"x": 409.08104049887015,"y": 124.1897323346388,"vy": -0.00017163403057317907,"vx": 0.006043804805463753}, 
        {"id": "Розвідувальна діяльність у сфері захисту державного кордону","value": 31.63,"size": "49268100","group": "1","index": 65,"x": 406.3852850546396,"y": 81.04516767208685,"vy": -0.0034293553183653604,"vx": 0.003978903501219649}, 
        {"id": "Розбудова прикордонної дорожньої інфраструктури на українсько-польському кордоні","value": 30.89,"size": "47200000","group": "5","index": 66,"x": 404.2003093184324,"y": 179.936590881866,"vy": 0.017833911535504926,"vx": 0.001024255493331134}, 
        {"id": "Апарат Міністерства охорони здоров'я України","value": 29.07,"size": "5808165400","group": "1","index": 67,"x": 405.105167608598,"y": 63.78393384060807,"vy": -0.004229344523641628,"vx": 0.008420660949551835}, 
        {"id": "Електронне урядування","value": 28.88,"size": "6903000","group": "1","index": 68,"x": 403.50991878719697,"y": 163.99336356033504,"vy": 0.0161953069268066,"vx": 0.002439591918442322}, 
        {"id": "Керівництво та управління діяльністю Міністерства внутрішніх справ України","value": 28.6,"size": "130320400","group": "1","index": 69,"x": 389.8658591494152,"y": 172.40846834524098,"vy": 0.015389829097735924,"vx": 0.0019714278522347723}, 
        {"id": "Базова дотація","value": 28.12,"size": "2915051200","group": "1","index": 70,"x": 400.0616704177957,"y": 32.88580820350006,"vy": -0.013171616920466986,"vx": 0.01010631985409846}, 
        {"id": "Фінансова підтримка санаторно-курортних закладів та закладів оздоровлення","value": 27.18,"size": "18423700","group": "7","index": 71,"x": 395.2175993026563,"y": 150.39870192583666,"vy": 0.010491405820799148,"vx": 0.007535065807434845}, 
        {"id": "Забезпечення заходів у сфері безпеки держави та діяльності органів системи Служби безпеки України","value": 27.17,"size": "2496383800","group": "2","index": 72,"x": 395.7545969706879,"y": 133.93555505936888,"vy": 0.00830128306085782,"vx": 0.011944607401717329}, 
        {"id": "Служба безпеки України","value": 25.96,"size": "2507244300","group": "2","index": 73,"x": 395.6892460691483,"y": 93.66480872324102,"vy": -0.003991091319928799,"vx": 0.0012290360640408323}, 
        {"id": "Здійснення правосуддя Вищим судом з питань інтелектуальної власності","value": 25.84,"size": "4533900","group": "3","index": 74,"x": 394.66555165751026,"y": 192.76586610806015,"vy": 0.019231439711158736,"vx": 0.001629893117063519}, 
        {"id": "Розвідувальна діяльність у сфері оборони","value": 25.52,"size": "701627400","group": "2","index": 75,"x": 389.2688898092168,"y": 56.4725766458965,"vy": -0.007256299718970708,"vx": 0.00981633304642727}, 
        {"id": "Міністерство фінансів України","value": 25.44,"size": "3829987200","group": "1","index": 76,"x": 396.7005955628297,"y": 111.0329110102607,"vy": -0.003472886953189154,"vx": -0.002417998823426261}, 
        {"id": "Головне управління розвідки Міністерства оборони України","value": 24.88,"size": "711632400","group": "2","index": 77,"x": 391.5703514019801,"y": 74.68491874847386,"vy": -0.006750831383942766,"vx": 0.0053541992873497694}, 
        {"id": "Керівництво та управління у сфері водного господарства","value": 24.17,"size": "7955900","group": "1","index": 78,"x": 385.26969941810233,"y": 24.52986754040507,"vy": -0.017799600780978034,"vx": 0.008218487360426322}, 
        {"id": "Підготовка кадрів у сфері цивільного захисту","value": 23.05,"size": "153213700","group": "1","index": 79,"x": 384.1602692374394,"y": 122.22626259185327,"vy": 0.00998749856116876,"vx": 0.006201657739408386}, 
        {"id": "Забезпечення медичних заходів окремих державних програм та комплексних заходів програмного характеру","value": 22.77,"size": "1496898500","group": "1","index": 80,"x": 381.60531829673755,"y": 102.91368992713082,"vy": -0.006466350110293519,"vx": -0.0015929579278949008}, 
        {"id": "Виконання робіт за державними цільовими програмами і державним замовленням у сфері космічної галузі, в тому числі загальнодержавної цільової науково-технічної космічної програми України","value": 21.02,"size": "16500000","group": "5","index": 81,"x": 381.45700048686956,"y": 142.23106501246107,"vy": 0.005056520854493385,"vx": 0.01054466648699306}, 
        {"id": "Реструктуризація вугільної галузі","value": 20.41,"size": "332746100","group": "1","index": 82,"x": 381.54694705479835,"y": 158.65914298868802,"vy": 0.012240049820439608,"vx": 0.0060132896647732}, 
        {"id": "Забезпечення функціонування державної системи спеціального зв'язку та захисту інформації","value": 19.76,"size": "334633800","group": "2","index": 83,"x": 370.11784603725687,"y": 114.52497221513829,"vy": 0.005024951309039564,"vx": 0.0068239445692857845}, 
        {"id": "Національне антикорупційне бюро України","value": 19.67,"size": "170636700","group": "2","index": 84,"x": 372.4566808641717,"y": 171.8767134752898,"vy": 0.01519138149605305,"vx": 0.007846705701753219}, 
        {"id": "Фінансова підтримка національних театрів","value": 19.66,"size": "227623300","group": "1","index": 85,"x": 367.73686221605635,"y": 150.5228738216883,"vy": 0.003036245381086704,"vx": 0.009772127424485058}, 
        {"id": "Керівництво та управління Національною гвардією України","value": 19.37,"size": "58338200","group": "1","index": 86,"x": 377.27474120118,"y": 67.26122818684846,"vy": -0.010025203994130035,"vx": 0.006268799909111053}, 
        {"id": "Підготовка кадрів та підвищення кваліфікації Національною академією Державної прикордонної служби України","value": 19.19,"size": "93392900","group": "1","index": 87,"x": 385.313331573221,"y": 40.48794239377015,"vy": -0.016541976235259034,"vx": 0.006760280656240265}, 
        {"id": "Керівництво та управління діяльністю у зоні відчуження","value": 19.19,"size": "3133700","group": "1","index": 88,"x": 380.7100839284339,"y": 86.58381103347612,"vy": -0.006790350747215531,"vx": 0.0039381113290894165}, 
        {"id": "Рада національної безпеки і оборони України","value": 19.16,"size": "34051200","group": "2","index": 89,"x": 380.2609084860902,"y": 185.8859802714129,"vy": 0.01984453312430024,"vx": 0.0003003734358324989}, 
        {"id": "Керівництво та управління діяльністю Національної поліції України","value": 19.13,"size": "153673900","group": "1","index": 90,"x": 370.4787399867426,"y": 130.64883248239647,"vy": 0.008149037382556642,"vx": 0.004175668099906737}, 
        {"id": "Міністерство освіти і науки України (загальнодержавні видатки та кредитування)","value": 19.07,"size": "13928284100","group": "1","index": 91,"x": 367.700509271109,"y": 17.124913400415572,"vy": -0.010648545420695824,"vx": 0.004790995400755791}, 
        {"id": "Державна підтримка діячів культури і мистецтва","value": 19.06,"size": "4831800","group": "1","index": 92,"x": 366.5455297289778,"y": 79.09821681635002,"vy": -0.010099826685504415,"vx": 0.004790538651853805}, 
        {"id": "Державна охорона органів державної влади та посадових осіб","value": 18.41,"size": "239909600","group": "2","index": 93,"x": 373.8162778253574,"y": 51.57481167293342,"vy": -0.010832713200449663,"vx": 0.00932962565763335}, 
        {"id": "Адміністрація Державної прикордонної служби України","value": 18.16,"size": "1962017300","group": "1","index": 94,"x": 363.8581078161437,"y": 185.9468690793398,"vy": 0.009573658828651773,"vx": -0.0003751828107586886}, 
        {"id": "Заходи із посилення інституційної спроможності для підготовки проектів державно-приватного партнерства","value": 17.95,"size": "935800","group": "1","index": 95,"x": 371.9836973880546,"y": 200.20260294337243,"vy": 0.010208129379601848,"vx": -0.0006539084572118927}, 
        {"id": "Управління державної охорони України","value": 17.86,"size": "239909600","group": "2","index": 96,"x": 367.2302873459672,"y": 95.12793769650358,"vy": -0.010299172434626951,"vx": -0.00015638072966182441}, 
        {"id": "Забезпечення розвідувальної діяльності у сфері безпеки держави, спеціального захисту державних представництв за кордоном та діяльності підрозділів системи Служби зовнішньої розвідки України","value": 17.62,"size": "339318300","group": "3","index": 97,"x": 357.9625822578754,"y": 46.840911421159035,"vy": -0.010937798609467862,"vx": 0.003537596734367857}, 
        {"id": "Вищий антикорупційний суд","value": 17.45,"size": "55518400","group": "3","index": 98,"x": 362.0752781040274,"y": 62.30057004924182,"vy": -0.010181430591823548,"vx": 0.0059114514075275125}, 
        {"id": "Збереження природно-заповідного фонду в національних природних парках та заповідниках","value": 17.38,"size": "14315400","group": "7","index": 99,"x": 356.4820369373453,"y": 123.03546873628734,"vy": 0.0026122853021540685,"vx": 0.0048155570993652416}, 
        {"id": "Керівництво та управління у сфері безпечності харчових продуктів та захисту споживачів","value": 17.21,"size": "277529100","group": "1","index": 100,"x": 352.9963458387715,"y": 87.65684219531168,"vy": -0.014384900194465353,"vx": 0.0007151616398776706}, 
        {"id": "Методичне забезпечення у сфері спорту","value": 17.18,"size": "255800","group": "1","index": 101,"x": 369.86862487107777,"y": 36.069053432075194,"vy": -0.010851315692844471,"vx": 0.0039178017479464915}, 
        {"id": "Державна авіаційна служба України","value": 17.01,"size": "50240000","group": "1","index": 102,"x": 349.52416570957155,"y": 71.97538955137576,"vy": -0.014555493877340585,"vx": -0.0014327181303655124}, 
        {"id": "Субвенція з державного бюджету місцевим бюджетам на забезпечення якісної, сучасної та доступної загальної середньої освіти «Нова українська школа»","value": 16.98,"size": "206334900","group": "1","index": 103,"x": 352.1022847425318,"y": 154.18780118809346,"vy": 0.012976033164304646,"vx": 0.012246719898175074}, 
        {"id": "Служба зовнішньої розвідки України","value": 16.75,"size": "339318300","group": "2","index": 104,"x": 354.62880129532994,"y": 31.07213523543522,"vy": -0.010738131004715028,"vx": 0.002773798601438416}, 
        {"id": "Керівництво та управління у сфері державної політики щодо зовнішніх відносин","value": 15.65,"size": "46361600","group": "1","index": 105,"x": 356.7168478658737,"y": 138.8958108368256,"vy": 0.007551393778212965,"vx": 0.0029472808990654463}, 
        {"id": "Національне агентство України з питань виявлення, розшуку та управління активами, одержаними від корупційних та інших злочинів","value": 14.97,"size": "35886300","group": "5","index": 106,"x": 345.2538236440727,"y": 56.62527363878532,"vy": -0.01625154067329678,"vx": -0.0011388672658736213}, 
        {"id": "Експлуатація державного водогосподарського комплексу та управління водними ресурсами","value": 14.83,"size": "588976500","group": "1","index": 107,"x": 356.5223145378863,"y": 169.68726647937746,"vy": 0.016913086823928333,"vx": 0.005555209641315379}, 
        {"id": "Міністерство оборони України","value": 14.66,"size": "15020011300","group": "1","index": 108,"x": 353.3405140173575,"y": 205.23931690523054,"vy": 0.012266725407354706,"vx": -0.0003564984635763902}, 
        {"id": "Забезпечення діяльності сил цивільного захисту","value": 14.45,"size": "1702231500","group": "1","index": 109,"x": 341.09191513559364,"y": 98.82469479356877,"vy": -0.0052577458655766645,"vx": 0.005440607940992157}, 
        {"id": "Апарат Міністерства внутрішніх справ України","value": 14.34,"size": "1747640900","group": "1","index": 110,"x": 355.72396552337995,"y": 106.72670732162135,"vy": -0.0002832429686372026,"vx": 0.007477357287689768}, 
        {"id": "Апарат Міністерства оборони України","value": 14.22,"size": "14458222600","group": "1","index": 111,"x": 344.312448347898,"y": 184.66026502646454,"vy": 0.011647505722655107,"vx": -0.0012507180620509493}, 
        {"id": "Вища освіта, енергоефективність та сталий розвиток","value": 14.14,"size": "19020000","group": "1","index": 112,"x": 332.4746454033093,"y": 66.19613292974641,"vy": -0.012042873855220071,"vx": 0.001068585906992827}, 
        {"id": "Забезпечення функцій Спеціалізованою антикорупційною прокуратурою","value": 14.1,"size": "18067900","group": "2","index": 113,"x": 323.46684265488915,"y": 141.32885117192558,"vy": 0.0062362125121082634,"vx": 0.010578727311267641}, 
        {"id": "Оплата послуг та відшкодування витрат адвокатів з надання безоплатної вторинної правової допомоги","value": 14.05,"size": "47450800","group": "1","index": 114,"x": 349.27773791831015,"y": 12.156483408713283,"vy": -0.018355838456260255,"vx": 0.006890643727235433}, 
        {"id": "Перепідготовка та підвищення кваліфікації у сфері боротьби з легалізацією (відмиванням) доходів, одержаних злочинним шляхом, і фінансуванням тероризму","value": 13.83,"size": "814400","group": "1","index": 115,"x": 334.1212240689452,"y": 200.91366070562265,"vy": 0.01250762315166385,"vx": -0.00037394375453130447}, 
        {"id": "Державне агентство водних ресурсів України","value": 13.77,"size": "589941200","group": "1","index": 116,"x": 339.6078477569001,"y": 25.013417653734525,"vy": -0.0177341364759108,"vx": 0.005834587858269445}, 
        {"id": "Національна поліція України","value": 13.66,"size": "4039106700","group": "1","index": 117,"x": 341.3071603265595,"y": 115.916395557144,"vy": -0.0012291495170116712,"vx": 0.0027744682619631257}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії аграрних наук України","value": 13.57,"size": "4833700","group": "6","index": 118,"x": 337.6534987472653,"y": 216.5059237479329,"vy": 0.01264906055016237,"vx": -0.0004034317821197092}, 
        {"id": "Державні стипендії видатним діячам інформаційної галузі, дітям журналістів, які загинули (померли) або яким встановлено інвалідність у зв’язку з виконанням професійних обов’язків та премій в інформаційній галузі","value": 13.54,"size": "437400","group": "1","index": 119,"x": 341.2658322770555,"y": 134.95087077307664,"vy": 0.003496280469043059,"vx": 0.002252988873821522}, 
        {"id": "Забезпечення діяльності підрозділів, установ та закладів Національної поліції України","value": 13.5,"size": "3885432800","group": "1","index": 120,"x": 336.5040958483106,"y": 82.44613377598027,"vy": -0.009365379218617258,"vx": -0.0009775248693362824}, 
        {"id": "Реалізація державної політики у сфері внутрішніх справ, забезпечення діяльності органів, установ та закладів Міністерства внутрішніх справ України","value": 13.44,"size": "739850600","group": "1","index": 121,"x": 322.2027134407037,"y": 190.03977380035076,"vy": 0.00966384323407551,"vx": 0.0018435161400334797}, 
        {"id": "Організація та регулювання діяльності установ в системі Державної служби України з питань безпечності харчових продуктів та захисту споживачів","value": 13.29,"size": "330369700","group": "1","index": 122,"x": 340.8906029836747,"y": 165.69258397890562,"vy": 0.010651788493407295,"vx": 0.005690925220694023}, 
        {"id": "Верховний Суд","value": 12.93,"size": "272824700","group": "3","index": 123,"x": 327.79273466957517,"y": 174.95068256089667,"vy": 0.006176976604265212,"vx": -0.00016014230641657882}, 
        {"id": "Координаційний центр з надання правової допомоги","value": 12.86,"size": "93626800","group": "1","index": 124,"x": 336.6179979396651,"y": 150.20929532346491,"vy": 0.00802824461962932,"vx": 0.012350503864520562}, 
        {"id": "Державна служба України з питань геодезії, картографії та кадастру","value": 12.46,"size": "212536500","group": "1","index": 125,"x": 334.9482914688027,"y": 4.9077843072185505,"vy": -0.011511118938210744,"vx": 0.003453913232955631}, 
        {"id": "Проведення судової експертизи і розробка методики проведення судових експертиз","value": 12.46,"size": "41031300","group": "1","index": 126,"x": 341.98851779933244,"y": 40.9606720547709,"vy": -0.01574300386122297,"vx": -0.003153873762701065}, 
        {"id": "Державна служба України з питань безпечності харчових продуктів та захисту споживачів","value": 12,"size": "583425900","group": "1","index": 127,"x": 325.10241655244454,"y": 17.69287419086892,"vy": -0.01141142416770619,"vx": 0.0024375500934302997}, 
        {"id": "Міністерство внутрішніх справ України","value": 11.84,"size": "9842546200","group": "1","index": 128,"x": 323.0039024060957,"y": 95.6812839568116,"vy": -0.004996378109816164,"vx": -0.00023151624239592546}, 
        {"id": "Забезпечення формування та функціонування системи безоплатної правової допомоги","value": 11.82,"size": "46176000","group": "1","index": 129,"x": 321.9870690562734,"y": 219.79436018933336,"vy": 0.013900110829756663,"vx": -0.0002240510425898989}, 
        {"id": "Наукове та інформаційно-аналітичне забезпечення заходів по боротьбі з організованою злочинністю і корупцією","value": 11.81,"size": "624800","group": "1","index": 130,"x": 326.8906960374357,"y": 34.879093247853895,"vy": -0.017313632191460697,"vx": 0.0050843811804740765}, 
        {"id": "Державна служба України з надзвичайних ситуацій","value": 11.5,"size": "1585687300","group": "1","index": 131,"x": 320.0133298145211,"y": 77.46700465069621,"vy": -0.00713596352126159,"vx": -0.0017858319287562196}, 
        {"id": "Освітня субвенція з державного бюджету місцевим бюджетам","value": 11.36,"size": "7909739400","group": "1","index": 132,"x": 320.53385559484406,"y": 158.60919784897933,"vy": 0.007766050853266556,"vx": -0.00012481385921817508}, 
        {"id": "Збереження природно-заповідного фонду","value": 11.21,"size": "43840400","group": "1","index": 133,"x": 329.2727424289189,"y": 50.651214414294,"vy": -0.014288001297078155,"vx": -0.0037968282411937585}, 
        {"id": "Виконання покарань установами і органами Державної кримінально-виконавчої служби України","value": 10.88,"size": "670611500","group": "1","index": 134,"x": 317.1576801945759,"y": 61.23671180286561,"vy": -0.008522219376942131,"vx": -0.0009671193496844462}, 
        {"id": "Субвенція з державного бюджету місцевим бюджетам на проектні, будівельно-ремонтні роботи, придбання житла та приміщень для розвитку сімейних та інших форм виховання, наближених до сімейних, та забезпечення житлом дітей-сиріт, дітей, позбавлених батьківського піклування, осіб з їх числа","value": 10.82,"size": "77657600","group": "1","index": 135,"x": 304.7582988948325,"y": 71.52929346985842,"vy": -0.007639374014400252,"vx": -0.0010179117591088388}, 
        {"id": "Будівництво об’єктів загальнодержавного значення у сфері культури","value": 10.8,"size": "54000000","group": "1","index": 136,"x": 328.07724551391186,"y": 126.202723737184,"vy": 0.0002697749983812711,"vx": -0.0002355382521651128}, 
        {"id": "Оздоровлення і відпочинок дітей, які потребують особливої уваги та підтримки, в дитячих оздоровчих таборах МДЦ Артек і ДЦ Молода Гвардія","value": 10.34,"size": "22464400","group": "1","index": 137,"x": 311.83661175785005,"y": 173.97813221363185,"vy": 0.008290080720514117,"vx": -0.002376485773751297}, 
        {"id": "Створення єдиної авіаційної системи безпеки та цивільного захисту","value": 10.17,"size": "451145300","group": "1","index": 138,"x": 302.7595079700339,"y": 160.4232338386484,"vy": 0.0074909120955893105,"vx": 0.00002704709752602598}, 
        {"id": "Забезпечення діяльності органів пробації","value": 10.1,"size": "63023300","group": "1","index": 139,"x": 306.58625488234674,"y": 102.89701450516685,"vy": 0.0038450912075097374,"vx": -0.0028391808430709192}, 
        {"id": "Загальне керівництво та управління у сфері освіти і науки","value": 10.02,"size": "12283900","group": "1","index": 140,"x": 313.8962091992748,"y": 45.42060032807952,"vy": -0.009042794446277452,"vx": 0.003344425653662317}, 
        {"id": "Будівництво (придбання) житла для військовослужбовців Головного управління розвідки Міністерства оборони України","value": 9.97,"size": "10005000","group": "2","index": 141,"x": 318.4731627454771,"y": 113.37218414852738,"vy": -0.005898821897215152,"vx": 0.009938814074307053}, 
        {"id": "Фінансова підтримка національних художніх колективів, концертних організацій та їх дирекції, національних і державних циркових організацій","value": 9.83,"size": "63180500","group": "1","index": 142,"x": 316.06796219338395,"y": 204.9169393995358,"vy": 0.012184769696993947,"vx": 0.003335564053592905}, 
        {"id": "Керівництво тафункціональне управління у сфері державної служби","value": 9.71,"size": "7299700","group": "1","index": 143,"x": 298.3708545360817,"y": 40.43951919084619,"vy": -0.013040398536629997,"vx": -0.0023905673632231496}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії наук України","value": 9.5,"size": "10225000","group": "6","index": 144,"x": 312.7328415703322,"y": 129.86061202648077,"vy": 0.011947007042882695,"vx": -0.002882811002340563}, 
        {"id": "Керівництво та військове управління Збройними Силами України","value": 9.49,"size": "62431200","group": "1","index": 145,"x": 306.83548644158805,"y": 87.13911231512971,"vy": -0.0018552854274467233,"vx": 0.0010860738963197278}, 
        {"id": "Довічні державні стипендії","value": 9.3,"size": "413400","group": "1","index": 146,"x": 306.5473270615145,"y": 10.93946074351485,"vy": -0.01248404212729402,"vx": 0.0024318900710098355}, 
        {"id": "Діагностика і лікування захворюваньіз впровадженням експериментальних та нових медичних технологій у закладах охорони здоров'я науково-дослідних установ тавищих навчальних медичних закладах Міністерства охорони здоров'я України","value": 9.07,"size": "142421600","group": "1","index": 147,"x": 306.0612067755692,"y": 189.00260207792354,"vy": 0.007786011547513359,"vx": 0.0017488474714043435}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії медичних наук України","value": 9.03,"size": "1725100","group": "6","index": 148,"x": 307.844265916119,"y": 145.13283546469782,"vy": 0.0056006323472893825,"vx": 0.0011938761855126016}, 
        {"id": "Забезпечення діяльності Збройних Сил України, підготовка кадрів і військ, медичне забезпечення особового складу, ветеранів військової служби та членів їхніх сімей, ветеранів війни","value": 8.89,"size": "7264367800","group": "1","index": 149,"x": 310.75885420252644,"y": 28.042548821045315,"vy": -0.012092643111590803,"vx": 0.0009502538250710172}, 
        {"id": "Забезпечення виконання завдань та функцій Національної гвардії України","value": 8.64,"size": "953002800","group": "1","index": 150,"x": 299.88392270966983,"y": 204.42332038401284,"vy": 0.0150896116112444,"vx": 0.0026643832855716976}, 
        {"id": "Здійснення правосуддя Вищим антикорупційним судом","value": 8.64,"size": "20834100","group": "3","index": 151,"x": 297.2070126954007,"y": 133.31249383401513,"vy": 0.009137973714256585,"vx": -0.006052839467743437}, 
        {"id": "Обслуговування та організаційне, інформаційно-аналітичне, матеріально-технічне забезпечення діяльності Верховної Ради України","value": 8.6,"size": "71848300","group": "7","index": 152,"x": 290.21014162637164,"y": 191.4470118001711,"vy": 0.014550002080989138,"vx": 0.0033221370390146975}, 
        {"id": "Підвищення кваліфікації з пріоритетних напрямів науки та підготовка до державної атестації наукових кадрів Національної академії наук України","value": 8.26,"size": "976800","group": "6","index": 153,"x": 296.1551519759511,"y": 176.48573808825867,"vy": 0.009898309896361987,"vx": -0.005011753390671677}, 
        {"id": "Національна комісія, що здійснює державне регулювання у сферах енергетики та комунальних послуг","value": 8.15,"size": "36750300","group": "7","index": 154,"x": 293.8824747459948,"y": 23.09896002564827,"vy": -0.007236728890726342,"vx": -0.0009698741894750419}, 
        {"id": "Забезпечення діяльності Національного центру обліку викидів парникових газів","value": 7.91,"size": "205900","group": "1","index": 155,"x": 286.68029708740346,"y": 163.54259345777456,"vy": 0.011212677056082225,"vx": -0.007251329848863074}, 
        {"id": "Функціонування Національної наукової медичної бібліотеки, збереження та популяризація історії медицини","value": 7.89,"size": "3327700","group": "1","index": 156,"x": 292.0134064703764,"y": 148.45776097182576,"vy": 0.011466836679193392,"vx": -0.005181379385860537}, 
        {"id": "Надання позашкільної освіти Національним центром аерокосмічної освіти молоді ім.О.М. Макарова","value": 7.85,"size": "695200","group": "5","index": 157,"x": 290.9752702090702,"y": 89.58740741165718,"vy": 0.003852429285400784,"vx": 0.0008826482345376304}, 
        {"id": "Фонд державного майна України","value": 7.82,"size": "55649800","group": "7","index": 158,"x": 289.2423034628456,"y": 67.79672299404427,"vy": -0.0002853103776564322,"vx": -0.004146544239716055}, 
        {"id": "Спеціалізована протезно-ортопедична та медично-реабілітаційнадопомога особам з інвалідністю у клініці Науково-дослідного інституту протезування, протезобудування та відновлення працездатності","value": 7.79,"size": "2103500","group": "1","index": 159,"x": 283.38549126201593,"y": 35.14016033349397,"vy": -0.011116992527407702,"vx": -0.005228967335980707}, 
        {"id": "Радіологічний захист населення та екологічне оздоровлення території, що зазнала радіоактивного забруднення","value": 7.61,"size": "271200","group": "1","index": 160,"x": 301.8932296355578,"y": 56.01490298567951,"vy": -0.013145586825354527,"vx": -0.000508207907838476}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії мистецтв України","value": 7.61,"size": "1140200","group": "6","index": 161,"x": 291.1439765504595,"y": 106.15827031669012,"vy": 0.005774099843963487,"vx": -0.006649214697124331}, 
        {"id": "Національна академія педагогічних наук України","value": 7.49,"size": "16969600","group": "6","index": 162,"x": 301.93399910979434,"y": 118.02756705366697,"vy": 0.009971868651386674,"vx": 0.0004859151762875158}, 
        {"id": "Підготовка кадрів, підвищення кваліфікації керівних працівників, спеціалістів державного управління, підготовка науково-педагогічних і наукових кадрів з питань стратегічних проблем внутрішньої і зовнішньої політики","value": 7.43,"size": "20729700","group": "7","index": 163,"x": 283.77309852777114,"y": 206.27207126100035,"vy": 0.018816535678681596,"vx": 0.0030091434136760857}, 
        {"id": "Санаторно-курортне лікування ветеранів війни, осіб, на яких поширюється чинність законів України «Про статус ветеранів війни, гарантії їх соціального захисту», «Про жертви нацистських переслідувань» та осіб з інвалідністю","value": 7.35,"size": "14570500","group": "1","index": 164,"x": 290.9725174068835,"y": 7.345342897500483,"vy": -0.006178813507332643,"vx": 0.00013481248983049365}, 
        {"id": "Національна гвардія України","value": 7.24,"size": "897165500","group": "1","index": 165,"x": 276.0458040832768,"y": 100.8578837221125,"vy": -0.0037452101095528266,"vx": -0.007600087788564014}, 
        {"id": "Розвиток фізичної культури, спорту вищих досягнень та резервного спорту","value": 7.22,"size": "127566500","group": "1","index": 166,"x": 281.5718028405174,"y": 136.39330532292317,"vy": 0.011392602183929979,"vx": -0.0073163554464791}, 
        {"id": "Національна академія мистецтв України","value": 7.11,"size": "2374200","group": "6","index": 167,"x": 286.53812338794296,"y": 121.37066044376068,"vy": 0.008089725035655906,"vx": -0.005116484058565923}, 
        {"id": "Підтримка культурно-оздоровчих та соціальних заходів фінансової системи","value": 7,"size": "521200","group": "1","index": 168,"x": 271.12069483387677,"y": 117.76848506438651,"vy": 0.005788685208886163,"vx": -0.0085465958257743}, 
        {"id": "Підвищення кваліфікації працівників органів юстиції","value": 6.91,"size": "1030300","group": "1","index": 169,"x": 286.6785171250537,"y": 51.29359466145891,"vy": -0.012407146361728036,"vx": -0.002962954098661149}, 
        {"id": "Збереження етнокультурної спадщини регіонів, постраждалих від наслідків Чорнобильської катастрофи","value": 6.75,"size": "492900","group": "1","index": 170,"x": 271.6229727153085,"y": 45.9617438197998,"vy": -0.010457880981858961,"vx": -0.004756508693527628}, 
        {"id": "Збереження природно-заповідного фонду в біосферному заповіднику Асканія-Нова","value": 6.7,"size": "1723500","group": "1","index": 171,"x": 278.8200624934222,"y": 17.702121707048004,"vy": -0.006869237334806522,"vx": -0.002010339910012209}, 
        {"id": "Підготовка робітничих кадрів у професійно-технічних закладах соціальної адаптації при установах виконання покарань","value": 6.58,"size": "291900","group": "1","index": 172,"x": 274.5134082032048,"y": 61.62015768465842,"vy": -0.00938443014639216,"vx": -0.0011324110740503462}, 
        {"id": "Забезпечення розслідування авіаційних подій та інцидентів з цивільними повітряними суднами Національним бюро","value": 6.52,"size": "1340900","group": "1","index": 173,"x": 274.2049084455582,"y": 193.49426723277304,"vy": 0.022046551462848462,"vx": -0.0027867586780998214}, 
        {"id": "Спеціалізована та високоспеціалізована медична допомога, що надається загальнодержавними закладами охорони здоров'я","value": 6.37,"size": "65459700","group": "1","index": 174,"x": 267.83606148829955,"y": 208.12919478714272,"vy": 0.02570687835315838,"vx": 0.0030701362690734096}, 
        {"id": "Організація діяльності рибовідтворювальних комплексів та інших бюджетних установу сфері рибного господарства","value": 6.33,"size": "5013500","group": "1","index": 175,"x": 278.4539781084307,"y": 79.63138042485136,"vy": 0.004024247495865053,"vx": 0.0006604486160003108}, 
        {"id": "Санаторне лікування хворих на туберкульоз та дітей і підлітків з соматичними захворюваннями","value": 6.28,"size": "29673700","group": "1","index": 176,"x": 264.5811211050273,"y": 180.72047521625376,"vy": 0.023493867428209244,"vx": -0.005634150778284738}, 
        {"id": "Керівництво та управління у сфері кінематографії","value": 6.17,"size": "771400","group": "1","index": 177,"x": 250.19487433718882,"y": 93.66567331616298,"vy": 0.000516540397252617,"vx": -0.00605142177797138}, 
        {"id": "Функціонування Державної науково-технічної бібліотеки","value": 6.1,"size": "533600","group": "1","index": 178,"x": 265.36664885236974,"y": 88.79008924386898,"vy": -0.006295338076465903,"vx": -0.0070478395644008015}, 
        {"id": "Національне агентство України з питань державної служби","value": 6.09,"size": "11911800","group": "5","index": 179,"x": 280.4718455669663,"y": 178.8160241427577,"vy": 0.020753542808561263,"vx": -0.005352512387617275}, 
        {"id": "Організаційне забезпечення реалізації інфраструктурних проектів","value": 6.01,"size": "611200","group": "1","index": 180,"x": 263.09552237669385,"y": 14.632460965897224,"vy": -0.011307491856372594,"vx": -0.0009163028698567306}, 
        {"id": "Керівництво та управління у сфері ефективного використання енергетичних ресурсів","value": 5.86,"size": "3491200","group": "1","index": 181,"x": 270.9190051963591,"y": 166.20971950047985,"vy": 0.01839004542351219,"vx": -0.00793252164426762}, 
        {"id": "Спеціалізована консультативна амбулаторно-поліклінічна та стоматологічна допомога, що надається вищими навчальними закладами, науково-дослідними установами та загальнодержавними закладами охорони здоров'я","value": 5.83,"size": "9770500","group": "1","index": 182,"x": 256.64836108595296,"y": 40.51992623166224,"vy": -0.007742369453945825,"vx": -0.007462711358393319}, 
        {"id": "Керівництво та управління у сфері архівної справи","value": 5.83,"size": "1480400","group": "1","index": 183,"x": 276.2493323680113,"y": 151.1399150146775,"vy": 0.01924167294617058,"vx": -0.004227527444530476}, 
        {"id": "Державна служба України з безпеки на транспорті","value": 5.82,"size": "7108100","group": "1","index": 184,"x": 258.30299257301095,"y": 195.29468560430462,"vy": 0.02854145567166349,"vx": -0.0017345656837465628}, 
        {"id": "Державна служба морського та річкового транспорту України","value": 5.81,"size": "2854400","group": "1","index": 185,"x": 273.5839415453357,"y": 2.586326255413587,"vy": -0.008680522276692443,"vx": 0.0032236000754760647}, 
        {"id": "Розвиток спорту серед осіб з інвалідністю та їх фізкультурно-спортивна реабілітація","value": 5.8,"size": "43618500","group": "1","index": 186,"x": 255.46466835708065,"y": 120.91128245153635,"vy": 0.0011937035897458704,"vx": -0.010764201945802566}, 
        {"id": "Національна служба посередництва і примирення України","value": 5.72,"size": "1782600","group": "7","index": 187,"x": 260.51884466405204,"y": 148.28077247899125,"vy": -0.003241690820079521,"vx": -0.0006479841109811248}, 
        {"id": "Керівництво та управління у сфері ядерного регулювання","value": 5.68,"size": "4299700","group": "7","index": 188,"x": 250.16494883188508,"y": 136.0650145520215,"vy": 0.002204485147166221,"vx": -0.007856103588219102}, 
        {"id": "Керівництво та управління у сфері лісового господарства","value": 5.66,"size": "7618100","group": "1","index": 189,"x": 260.65237489019006,"y": 105.76304052431854,"vy": 0.002198283162653467,"vx": -0.006883361595482884}, 
        {"id": "Державна інспекція ядерного регулювання України","value": 5.64,"size": "4299700","group": "7","index": 190,"x": 268.34015132632595,"y": 29.724530194627203,"vy": -0.009131857365664077,"vx": -0.006120192912466072}, 
        {"id": "Реалізація проекту з розбудови підрозділів охорони кордону","value": 5.61,"size": "287000","group": "1","index": 191,"x": 251.3447852809922,"y": 25.4438153341925,"vy": -0.010457245878873011,"vx": -0.0015000948154169143}, 
        {"id": "Здійснення прокурорсько-слідчої діяльності, підготовка та підвищення кваліфікації кадрів прокуратури","value": 5.58,"size": "397887000","group": "2","index": 192,"x": 255.19868670294971,"y": 163.44704220633372,"vy": -0.005237827067177625,"vx": -0.006526002959516153}, 
        {"id": "Агентство з управління державним боргом","value": 5.52,"size": "2758500","group": "1","index": 193,"x": 239.5621682811766,"y": 167.1556162703728,"vy": -0.005368052085494498,"vx": -0.007242809715110758}, 
        {"id": "Апарат Державної інспекції ядерного регулювання України","value": 5.64,"size": "4299700","group": "7","index": 194,"x": 259.3648705100536,"y": 56.325359009525684,"vy": -0.007642242702831432,"vx": -0.0008411537084523147}, 
        {"id": "Генеральна прокуратура України","value": 5.51,"size": "400863800","group": "2","index": 195,"x": 265.9089028547708,"y": 133.08202222639193,"vy": -0.0024600936337765933,"vx": -0.0064521837178567795}, 
        {"id": "Міністерство освіти і науки України","value": 5.49,"size": "2315646800","group": "1","index": 196,"x": 262.3011236824073,"y": 72.61493056740005,"vy": -0.00823382388633562,"vx": -0.002141951048314972}, 
        {"id": "Національна комісія, що здійснює державне регулювання у сфері зв'язку та інформатизації","value": 5.37,"size": "4649600","group": "7","index": 197,"x": 251.5738897302223,"y": 209.8209856246024,"vy": 0.02688436722149024,"vx": -0.004942886693115237}, 
        {"id": "Виконання робіт у сфері поводження з радіоактивними відходами неядерного циклу, будівництво комплексу Вектор та експлуатація його об'єктів","value": 5.24,"size": "49188000","group": "1","index": 198,"x": 239.83850755545905,"y": 81.67774363929414,"vy": -0.003360572869561886,"vx": -0.0070335308290454986}, 
        {"id": "Вищий суд з питань інтелектуальної власності","value": 5.16,"size": "1547300","group": "3","index": 199,"x": 244.2964180623822,"y": 50.42531891342893,"vy": -0.005414853025528177,"vx": -0.010327172320846586}, 
        {"id": "Апарат Міністерства освіти і науки України","value": 5.14,"size": "2166888500","group": "1","index": 200,"x": 246.43290466469267,"y": 66.71682357765417,"vy": -0.005284153322199044,"vx": -0.004581320140770522}, 
        {"id": "Забезпечення діяльності національних музеїв, національних і державних бібліотек та культурно-просвітницьких центрів","value": 5.12,"size": "38921200","group": "1","index": 201,"x": 239.7846279336021,"y": 123.88635212430589,"vy": -0.0010150088741156303,"vx": -0.012117819672686677}, 
        {"id": "Наукова і організаційна діяльність президії Національної академії педагогічних наук України","value": 5.04,"size": "1150200","group": "6","index": 202,"x": 248.73296189570854,"y": 180.2504959924297,"vy": -0.004078430851956276,"vx": -0.008203376164707961}, 
        {"id": "Управління та випробування космічних засобів","value": 4.99,"size": "17212700","group": "5","index": 203,"x": 244.7786757229413,"y": 151.1987891561139,"vy": -0.009338431886677514,"vx": -0.0007123991764654565}, 
        {"id": "Функціонування закордонних дипломатичних установ України та розширення мережі власності України для потреб цих установ","value": 4.98,"size": "164865100","group": "1","index": 204,"x": 245.02771112607934,"y": 108.78823075964092,"vy": -0.00038290256611941406,"vx": -0.009680891320391702}, 
        {"id": "Підготовка кадрів Київським національним університетом імені Тараса Шевченка","value": 4.91,"size": "80516800","group": "1","index": 205,"x": 242.2806408520641,"y": 194.93444758604562,"vy": -0.001352132690716207,"vx": -0.0008547643523710332}, 
        {"id": "Загальне керівництво та управління у сфері інфраструктури","value": 4.78,"size": "5422700","group": "1","index": 206,"x": 236.42099756546645,"y": 19.655407138600395,"vy": -0.010446073252347069,"vx": -0.0013986617414344972}, 
        {"id": "Керівництво та управління у сфері охорони здоров'я","value": 4.75,"size": "4236300","group": "1","index": 207,"x": 229.2815453864429,"y": 111.74359130547133,"vy": -0.0011483729993340963,"vx": -0.010852396333718962}, 
        {"id": "Реалізація пілотного проекту щодо зміни механізму фінансового забезпечення надання медичної допомоги у окремих науково-дослідних установах Національної академії медичних наук України","value": 4.6,"size": "32340100","group": "6","index": 208,"x": 232.81897522553038,"y": 181.71743846328476,"vy": -0.006699404879159684,"vx": -0.008945073986343262}, 
        {"id": "Щорічна разова грошова допомога ветеранам війни і жертвам нацистських переслідувань та соціальна допомога особам, які мають особливі та особливі трудові заслуги перед Батьківщиною","value": 4.44,"size": "58807200","group": "1","index": 209,"x": 228.575328301294,"y": 47.73324412301886,"vy": -0.015158764123751976,"vx": -0.009997341306652918}, 
        {"id": "Виконання державних цільових програм реформування та розвитку оборонно-промислового комплексу, розроблення, освоєння і впровадження нових технологій, нарощування наявних виробничих потужностей для виготовлення продукції оборонного призначення","value": 4.39,"size": "106500000","group": "1","index": 210,"x": 223.749823908768,"y": 164.8324777246966,"vy": 0.012143256986206257,"vx": -0.010982602936984455}, 
        {"id": "Державна архітектурно-будівельна інспекція України","value": 4.34,"size": "8379000","group": "1","index": 211,"x": 230.09618212386988,"y": 68.89218877292782,"vy": -0.0036414072113329548,"vx": -0.004362664419667407}, 
        {"id": "Керівництво та управління у сфері архітектурно-будівельного контролю та нагляду","value": 4.34,"size": "8379000","group": "1","index": 212,"x": 234.5520803583183,"y": 138.94103121391353,"vy": -0.00044480747162099483,"vx": -0.012415683687830236}, 
        {"id": "Державна підтримка фізкультурно-спортивного товариства Динамо України на організацію та проведення роботи з розвитку фізичної культури і спорту серед працівників і військовослужбовців правоохоронних органів","value": 4.27,"size": "978800","group": "1","index": 213,"x": 234.55406363619835,"y": 96.66291989402893,"vy": -0.0014089491779611045,"vx": -0.0083738303472257}, 
        {"id": "Підвищення кваліфікації працівників засобів масової інформації в Укртелерадіопресінституті","value": 4.21,"size": "310600","group": "1","index": 214,"x": 238.8746631323648,"y": 35.46914415749872,"vy": -0.010482457233575639,"vx": -0.0014489093264071938}, 
        {"id": "Забезпечення діяльності Українського інституту книги, підтримка книговидавничої справи та популяризація української літератури у світі","value": 4.2,"size": "6119200","group": "1","index": 215,"x": 218.83414348901974,"y": 99.59730977032248,"vy": -0.0021941151396624244,"vx": -0.008438071591684986}, 
        {"id": "Медичне обслуговування і оздоровлення особового складу та утримання закладів дошкільної освіти Служби безпеки України","value": 4.15,"size": "9594400","group": "2","index": 216,"x": 222.10044977413511,"y": 148.94113541843308,"vy": 0.010415650982464069,"vx": -0.004621953278039934}, 
        {"id": "Міністерство закордонних справ України","value": 4.08,"size": "183660400","group": "1","index": 217,"x": 224.0461637198023,"y": 126.87061494749615,"vy": -0.000931052500837038,"vx": -0.01256543238973215}, 
        {"id": "Вища рада правосуддя","value": 4.02,"size": "9051700","group": "3","index": 218,"x": 226.32096723021797,"y": 196.35683228695095,"vy": -0.003297670795926457,"vx": -0.0009444523636601615}, 
        {"id": "Висвітлення діяльностіВерховноїРадиУкраїни череззасобителебаченняі радіомовлення та фінансова підтримка видання газети Голос України","value": 3.91,"size": "1750100","group": "7","index": 219,"x": 223.1180901892477,"y": 32.68618060956006,"vy": -0.0188726966150545,"vx": 0.000030579407511675466}, 
        {"id": "Наукове і науково-методичне забезпечення у сфері виробництва і використання дорогоцінного і напівдорогоцінного каміння та забезпечення виробничих та соціально-культурних потреб у дорогоцінних металах і дорогоцінному камінні","value": 3.9,"size": "819500","group": "1","index": 220,"x": 224.16016681744912,"y": 84.52538672165335,"vy": -0.002165715097967184,"vx": -0.008559225214697307}, 
        {"id": "Організація і регулювання діяльності установ в системі агропромислового комплексу та забезпечення діяльності Аграрного фонду","value": 3.66,"size": "5182700","group": "1","index": 221,"x": 211.56329838921997,"y": 136.90530785867804,"vy": 0.010035954777966658,"vx": -0.004461932454935378}, 
        {"id": "Забезпечення здійснення правосуддя місцевими, апеляційними судами та функціонування органів і установ системи правосуддя","value": 3.63,"size": "511879300","group": "3","index": 222,"x": 213.44098285493106,"y": 114.71702409953016,"vy": -0.0024453934242901765,"vx": -0.011649959264953743}, 
        {"id": "Державна судова адміністрація України","value": 3.61,"size": "509879300","group": "3","index": 223,"x": 216.87479066995147,"y": 179.39956796595453,"vy": 0.012408637026206181,"vx": -0.011927801646255108}, 
        {"id": "Керівництво та управління у сфері відновлення та збереження національної пам’яті","value": 3.53,"size": "1124900","group": "1","index": 224,"x": 213.82214070614717,"y": 72.30627998410536,"vy": -0.0022628191707610356,"vx": -0.008111819954447439}, 
        {"id": "Міністерство юстиції України","value": 3.42,"size": "474793700","group": "1","index": 225,"x": 208.3297277479953,"y": 87.41432085421299,"vy": -0.0019039689841839533,"vx": -0.008900244710575359}, 
        {"id": "Фінансове забезпечення виплати пенсій, надбавок та підвищень до пенсій, призначених за пенсійними програмами, та дефіциту коштів Пенсійного фонду","value": 3.33,"size": "5563387000","group": "1","index": 226,"x": 207.7128842615835,"y": 158.41088487925327,"vy": 0.005699887698127858,"vx": -0.007935534070306779}, 
        {"id": "Селекція у рибному господарстві та відтворення водних біоресурсів у внутрішніх водоймах та Азово-Чорноморському басейні","value": 3.32,"size": "200000","group": "1","index": 227,"x": 215.1356362255914,"y": 56.35559413276864,"vy": -0.0015691364253078543,"vx": -0.0023370257300095515}, 
        {"id": "Фінансова підтримка громадських організацій фізкультурно-спортивного спрямування","value": 3.22,"size": "1838400","group": "1","index": 228,"x": 197.50297641362255,"y": 144.54844895904122,"vy": 0.004778778416864,"vx": -0.007258135848090234}, 
        {"id": "Надання фінансової підтримки державному підприємству Кримський дім","value": 3.13,"size": "128500","group": "1","index": 229,"x": 202.87787824022752,"y": 102.55876255845064,"vy": -0.002683258763434508,"vx": -0.011610249595935743}, 
        {"id": "Керівництво та управління у сфері космічної діяльності","value": 3.1,"size": "1038700","group": "5","index": 230,"x": 195.30741308065905,"y": 77.96086572313143,"vy": -0.0048746193412633,"vx": -0.007123691426592892}, 
        {"id": "Виробництво та трансляція телерадіопрограм для державних потреб, збирання, обробка та розповсюдження офіційної інформаційної продукції, фінансова підтримка системи державного іномовлення України","value": 3.06,"size": "12987600","group": "1","index": 231,"x": 201.5249380557835,"y": 174.48802540080342,"vy": 0.0052291585385300585,"vx": -0.009605323655265171}, 
        {"id": "Пенсійний фонд України","value": 3.02,"size": "5063387000","group": "1","index": 232,"x": 198.72007999035085,"y": 61.19073423101106,"vy": -0.0042150649515468675,"vx": -0.003264203730537567}, 
        {"id": "Апарат Міністерства юстиції України","value": 2.92,"size": "376820000","group": "1","index": 233,"x": 200.86775528616545,"y": 124.88897480146527,"vy": 0.008939849515771264,"vx": -0.0031382899173176353}, 
        {"id": "Впровадження Програми реформування та розвитку енергетичного сектора","value": 2.54,"size": "716000","group": "1","index": 234,"x": 186.79568919853776,"y": 132.65760521311333,"vy": 0.0038348660592002135,"vx": -0.00619936883825393}, 
        {"id": "Керівництво та управління у сфері соціальної політики","value": 2.08,"size": "3604000","group": "1","index": 235,"x": 184.226175426068,"y": 89.47213743635307,"vy": 0.0006159212150120688,"vx": -0.0021362676374109568}, 
        {"id": "Український інститут національної пам'яті","value": 2.05,"size": "2608800","group": "1","index": 236,"x": 188.4269820785168,"y": 114.68943402776445,"vy": 0.0028097736421079174,"vx": 0.0014518242925518072}, 
        {"id": "Національна академія аграрних наук України","value": 1.9,"size": "24389500","group": "6","index": 237,"x": 176.83126824144878,"y": 103.6599390388443,"vy": 0.0026734767769605195,"vx": 0.0014522929610262007}, 
        {"id": "Державна архівна служба України","value": 1.88,"size": "4346900","group": "1","index": 238,"x": 173.26074779230768,"y": 119.79784784867668,"vy": 0.00013453506136416947,"vx": 0.0006186064036445963}, 
        {"id": "Апарат Верховної Ради України","value": 1.88,"size": "37084000","group": "7","index": 239,"x": 171.07061455368566,"y": 135.65620030655046,"vy": -0.0009257432669019196,"vx": -0.007107449161087152}, 
        {"id": "Державне агентство рибного господарства України","value": 1.66,"size": "6956400","group": "1","index": 240,"x": 165.23666844789648,"y": 92.61945822295101,"vy": 0.0026684238936143536,"vx": 0.0015378791712260132}, 
        {"id": "Заходи з реалізації державної політики у сфері відновлення та збереження національної пам’яті, забезпечення діяльності Національного меморіального комплексу Героїв Небесної Сотні - Музею Революції гідності та Галузевого державного архіву Українського інституту національної пам’яті","value": 1.56,"size": "1483900","group": "1","index": 241,"x": 161.672389427088,"y": 108.7707846983919,"vy": 0.00018889443911826331,"vx": 0.0004191700794421285}, 
        {"id": "Забезпечення діяльності архівних установ та установ страхового фонду документації","value": 1.47,"size": "2866500","group": "1","index": 242,"x": 157.91089587723351,"y": 124.3232277643349,"vy": 0.00017121369432436203,"vx": 0.0004271482580720069}, 
        {"id": "Заходи із соціальної, трудової та професійної реабілітації осіб з інвалідністю","value": 1.45,"size": "21963300","group": "1","index": 243,"x": 157.70974023127735,"y": 78.49392149698434,"vy": 0.0026983808751844013,"vx": 0.0014576238463008355}, 
        {"id": "Виконання зобов’язань України у Рамковій програмі Європейського Союзу з наукових досліджень та інновацій Горизонт 2020","value": 1.39,"size": "5311800","group": "1","index": 244,"x": 154.14409338539915,"y": 139.8780680474983,"vy": 0.00015274766528975916,"vx": 0.000565439428633666}, 
        {"id": "Підвищення кваліфікації фахівців агропромислового комплексу","value": 1.35,"size": "324700","group": "1","index": 245,"x": 150.07895188906963,"y": 97.7445317485478,"vy": -0.0000012922781260881788,"vx": 0.0005974198929998583}, 
        {"id": "Доставка спеціальної службової кореспонденції органам державної влади","value": 1.34,"size": "2737900","group": "2","index": 246,"x": 146.32346346889324,"y": 113.29002392473691,"vy": 0.00015800032146936438,"vx": 0.00037709076154848796}, 
        {"id": "Головне управління урядового фельд’єгерського зв’язку Державної служби спеціального зв'язку та захисту інформації України","value": 1.31,"size": "2737900","group": "2","index": 247,"x": 142.55847816403738,"y": 128.84469026322736,"vy": 0.00012611544457525153,"vx": 0.0005071653729800499}, 
        {"id": "Керівництво та управління у сфері рибного господарства","value": 1.3,"size": "4242900","group": "1","index": 248,"x": 142.55056883093576,"y": 83.62833841027448,"vy": -0.00004346365181213894,"vx": 0.0005097001652248117}, 
        {"id": "Керівництво та управління у сфері юстиції","value": 1.12,"size": "49075000","group": "1","index": 249,"x": 130.96062563243424,"y": 117.80747298048432,"vy": 0.0001853149764376699,"vx": 0.00042345756995121857}, 
        {"id": "Державна служба геології та надр України","value": 1.06,"size": "1647700","group": "1","index": 250,"x": 130.60293423997064,"y": 101.805542491203,"vy": 0.00006691575592262027,"vx": 0.0001879112731410002}, 
        {"id": "Розбудова прикордонної дорожньої інфраструктури на українсько-угорському державному кордоні","value": 1.05,"size": "280000","group": "5","index": 251,"x": 126.76912511969843,"y": 86.27120869299276,"vy": -0.00001486897989102084,"vx": 0.0005192814190228392}, 
        {"id": "Фонд соціального захисту інвалідів","value": 1.03,"size": "18666500","group": "1","index": 252,"x": 127.20412380606167,"y": 133.37217413116255,"vy": 0.0002781471533073509,"vx": 0.0004997918968863383}, 
        {"id": "Національна академія наук України","value": 0.43,"size": "21247300","group": "6","index": 253,"x": 58.434299816936026,"y": 102.68128889714828,"vy": 0.000006958608281723479,"vx": 1.68345908348232e-7}, 
        {"id": "Підтримка екологічно безпечного стану у зонах відчуження і безумовного (обов'язкового) відселення","value": 0.4,"size": "1971100","group": "1","index": 254,"x": 51.76049307570027,"y": 117.22861081573426,"vy": 0.000006907794608370992,"vx": 5.7584080526899664e-8}, 
        {"id": "Діагностика і лікування захворювань із впровадженням експериментальних та нових медичних технологій, спеціалізована консультативно-поліклінічна допомога, що надається науково-дослідними установами Національної академії медичних наук України","value": 0.21,"size": "3897500","group": "6","index": 255,"x": 0.08380726498310195,"y": 109.99205246034005,"vy": 9.88336626264334e-7,"vx": 1.1228124556492461e-7}
    ],
    [
        {"id": "Податок та збір на доходи фізичних осіб","value": 21.86,"size": "23209106700","group": "1","index": 0,"x": 552.2942873920643,"y": 103.20672384973419,"vy": -0.00004875112256324063,"vx": 0.000012869683933628295},
        {"id": "Податок на прибуток підприємств","value": 24.48,"size": "23380000000","group": "1","index": 1,"x": 567.616585103323,"y": 142.30494892666158,"vy": 0.00005995735178910939,"vx": 0.000001955713148644559},
        {"id": "Рентна плата за користування надрами для видобування корисних копалин загальнодержавного значення","value": 8.62,"size": "315200000","group": "1","index": 2,"x": 466.8176487464647,"y": 110.21566441781124,"vy": 0.00004298722183474716,"vx": -0.00004994905911995112},
        {"id": "Акцизний податок з вироблених в Україні підакцизних товарів (продукції)","value": 2.23,"size": "1916139000","group": "1","index": 3,"x": 327.13943979757005,"y": 104.23224411556042,"vy": 0.00003981358483877037,"vx": -0.0000011960419505960446},
        {"id": "Виноробна продукція, для виробництва якої не використовується спирт етиловий","value": 21.37,"size": "266000000","group": "1","index": 4,"x": 557.7919887434588,"y": 74.63055342507255,"vy": -0.00004124192476181601,"vx": -0.000032694181264212444},
        {"id": "Пиво","value": 0.76,"size": "36000000","group": "1","index": 5,"x": 222.00767144072478,"y": 117.97946570488448,"vy": 0.000006234340797152535,"vx": 3.2875103304735407e-10},
        {"id": "Тютюн та тютюнові вироби","value": 0.56,"size": "319000000","group": "1","index": 6,"x": 192.0177995020489,"y": 118.14893255646493,"vy": 0.0000044411537512512854,"vx": 3.0350588512358e-10},
        {"id": "Електрична енергія","value": 7.92,"size": "493000000","group": "1","index": 7,"x": 450.37280556967363,"y": 109.75151923033938,"vy": 0.000015481311999296366,"vx": -0.000039563392663381635},
        {"id": "Пальне","value": 365.84,"size": "35841139000","group": "1","index": 8,"x": 832.9852783202549,"y": 81.97268318125641,"vy": 0.000004121783358792142,"vx": 1.2905078799899017e-10},
        {"id": "Виноробна продукція, для виробництва якої використовується спирт етиловий","value": 16,"size": "24000000","group": "1","index": 9,"x": 523.5732825543822,"y": 106.91315297601388,"vy": -0.000003362419677434541,"vx": -0.00010586218377801803},
        {"id": "Акцизний податок з ввезених на митну територію України підакцизних товарів (продукції)","value": 19.86,"size": "8801395000","group": "1","index": 10,"x": 536.7878583089059,"y": 73.10667568333994,"vy": -0.00010049402659195164,"vx": -0.000038311708819425436},
        {"id": "Виноробна продукція","value": 168.51,"size": "305000000","group": "1","index": 11,"x": 756.1578774770293,"y": 102.23142338159603,"vy": 0.000003463310417868093,"vx": -6.182208394300489e-11},
        {"id": "Пиво","value": 0.76,"size": "36000000","group": "1","index": 12,"x": 222.00767666826297,"y": 101.93929955944945,"vy": 0.000006234340797177189,"vx": -3.829050550394361e-12},
        {"id": "Тютюн та тютюнові вироби","value": 0.56,"size": "319000000","group": "1","index": 13,"x": 192.01780526367418,"y": 101.79292814600221,"vy": 0.000004441153744289797,"vx": -4.961542755430119e-11},
        {"id": "Пальне","value": 365.84,"size": "35841139000","group": "1","index": 14,"x": 832.985288383877,"y": 137.9726831812555,"vy": 0.000004121783355875464,"vx": -8.018805253171207e-11},
        {"id": "Інші підакцизні товари іноземного виробництва","value": 8.33,"size": "3000000","group": "1","index": 15,"x": 459.0847632761853,"y": 96.00359679889083,"vy": 0.00004532323877730589,"vx": 0.000046985028205574146},
        {"id": "Податок на додану вартість з вироблених в Україні товарів (робіт, послуг) з урахуванням бюджетного відшкодування","value": 2.33,"size": "2200000000","group": "1","index": 16,"x": 332.0051090169954,"y": 121.87169147940257,"vy": 0.000006220198168004347,"vx": 0.0000022736244364450314},
        {"id": "Податок на додану вартість з ввезених на митну територію України товарів","value": 2.72,"size": "9256000000","group": "1","index": 17,"x": 349.13922259548866,"y": 107.45498682599589,"vy": -0.000008057313384275533,"vx": -0.0000020529104501399644},
        {"id": "Ввізне мито","value": 3.39,"size": "1045000000","group": "1","index": 18,"x": 370.30845446261253,"y": 102.47137590579321,"vy": -0.000002349935846504038,"vx": 0.0000040016202354352925},
        {"id": "Податки і збори, не віднесені до інших категорій, та кошти, що передаються (отримуються) відповідно до бюджетного законодавства","value": 163.31,"size": "276000","group": "1","index": 19,"x": 752.8213101594405,"y": 118.05378610001259,"vy": 0.000003463353024056657,"vx": 1.402349420994483e-10},
        {"id": "Інші надходження","value": 57.51,"size": "1671481800","group": "2","index": 20,"x": 650.1203414633624,"y": 101.42737384648714,"vy": 0.0000013072724910128709,"vx": -0.0000030002809326002374},
        {"id": "Плата за надання адміністративних послуг","value": 210.79,"size": "3395386400","group": "2","index": 21,"x": 777.2231061067341,"y": 104.25738815938787,"vy": 0.00000466976689076175,"vx": 9.760289308539948e-11},
        {"id": "Адміністративний збір за проведення державної реєстрації юридичних осіб,фізичних осіб - підприємців та громадських формувань","value": 63.94,"size": "9233000","group": "2","index": 22,"x": 661.6544661789262,"y": 113.83145822769968,"vy": -1.950129345830765e-7,"vx": -0.000007758147811670162},
        {"id": "Плата за видачу, продовження, переоформлення ліцензій і за видачу дубліката ліцензій на мовлення, та ліцензій провайдера програмної послуги","value": 5.26,"size": "1000000","group": "2","index": 23,"x": 414.01074862877374,"y": 110.01465570305072,"vy": -0.000001338474148807349,"vx": -0.000001417215966215564},
        {"id": "Плата за видачу, переоформлення, продовження терміну дії ліцензій на користування радіочастотним ресурсом України та видачу дублікатів таких ліцензій","value": 589.66,"size": "171000000","group": "2","index": 24,"x": 879.9835296059816,"y": 109.97881883783018,"vy": 0.0000031936773065676417,"vx": 1.954230440190667e-11},
        {"id": "Плата за видачу, переоформлення, продовження терміну дії ліцензій на здійснення діяльності у сфері телекомунікацій та видачу копій і дублікатів таких ліцензій","value": 50,"size": "5000000","group": "2","index": 25,"x": 634.5470741761293,"y": 108.08220526924023,"vy": 0.000019207605728059478,"vx": 0.0000064534092767990325},
        {"id": "Плата за видачу дозволів на право ввезення на територію України, вивезення з території України або транзиту через територію України наркотичних засобів, психотропних речовин і прекурсорів","value": 75.68,"size": "2800000","group": "2","index": 26,"x": 677.1309695150021,"y": 109.7506861486108,"vy": -0.000027692509773065644,"vx": 0.0000148573671919151},
        {"id": "Збір за видачу спеціальних дозволів на користування надрами та кошти від продажу таких дозволів","value": 25,"size": "50000000","group": "2","index": 27,"x": 568.0981727726739,"y": 171.3753139116237,"vy": 0.00005999611483438957,"vx": -3.8415795492753566e-7},
        {"id": "Плата за державну реєстрацію джерел іонізуючого випромінювання (реєстраційний збір)","value": 13.97,"size": "22400","group": "2","index": 28,"x": 507.59399523896224,"y": 105.85678797280414,"vy": 0.000035273613830542825,"vx": -0.00009038155727830071},
        {"id": "Плата за надання інших адміністративних послуг","value": 15,"size": "91652700","group": "2","index": 29,"x": 514.6490553764762,"y": 120.2732075878206,"vy": 0.000014805535238801303,"vx": 0.000004643815810490004},
        {"id": "Адміністративний збір за державну реєстрацію речових прав на нерухоме майно та їх обтяжень","value": 4.55,"size": "9132000","group": "2","index": 30,"x": 398.95533143514365,"y": 118.04076279166786,"vy": 0.000010314956669919806,"vx": -1.1118403409827905e-7},
        {"id": "Судовий збір та надходження від звернення застави у дохід держави","value": 4.56,"size": "172005500","group": "2","index": 31,"x": 400.0636976425785,"y": 101.97789013293185,"vy": 0.000010424632681807357,"vx": 0.0000014782844112568913},
        {"id": "Надходження від орендної плати за користування цілісним майновим комплексом та іншим державним майном","value": 241.67,"size": "2900000000","group": "2","index": 32,"x": 792.788882814743,"y": 116.02433249438296,"vy": 0.000004670020766866915,"vx": -9.423805733162204e-11},
        {"id": "Портовий (адміністративний) збір","value": 6.7,"size": "11856000","group": "2","index": 33,"x": 436.4413207310732,"y": 101.32766544378227,"vy": -0.00011630366052807496,"vx": 0.000001374931439875786},
        {"id": "Надходження сум кредиторської та депонентської заборгованості підприємств, організацій та установ, щодо яких минув строк позовної давності","value": 55.75,"size": "20395000","group": "2","index": 34,"x": 646.4332775210233,"y": 118.81400294097524,"vy": 0.000037177128838957244,"vx": -0.000009770861073645593},
        {"id": "Кошти від реалізації надлишкового озброєння, військової та спеціальної техніки, нерухомого військового майна Збройних Сил України та інших утворених відповідно до законів України військових формувань, правоохоронних органів та інших державних органів","value": 0.08,"size": "10000","group": "2","index": 35,"x": 0.009224478380642722,"y": 109.97955915729669,"vy": 0.00000314354661567281,"vx": 4.9396534235405096e-11},
        {"id": "Надходження до Державного спеціалізованого фонду фінансування загальнодержавних витрат на авіаційну діяльність та участь України у міжнародних авіаційних організаціях","value": 17.01,"size": "62800000","group": "2","index": 36,"x": 525.9840939718366,"y": 91.04832869609899,"vy": -0.00003089704605439693,"vx": -0.000058741769013409035},
        {"id": "Збір на соціально-економічну компенсацію ризику населення, яке проживає на території зони спостереження","value": 3.68,"size": "15678500","group": "2","index": 37,"x": 378.4110503301549,"y": 116.95025639109292,"vy": 1.8870777008387144e-7,"vx": -5.347905688280939e-7},
        {"id": "Збори на обов'язкове державне пенсійне страхування з окремих видів господарських операцій","value": 25.25,"size": "1887950200","group": "2","index": 38,"x": 573.3886278340477,"y": 81.86744099971722,"vy": 0.0000863915823912839,"vx": 0.00011634658317162637},
        {"id": "Збір під час набуття права власності на легкові автомобілі","value": 25.67,"size": "930131000","group": "2","index": 39,"x": 581.2253112057978,"y": 97.59576507619666,"vy": 0.00012132338180972466,"vx": 0.00004623842625653201},
        {"id": "Збір з операцій придбавання (купівлі-продажу) нерухомого майна","value": 41.48,"size": "530962800","group": "2","index": 40,"x": 617.9960627329762,"y": 109.9659077584766,"vy": 0.000002598402797160418,"vx": -1.5830655865306674e-9},
        {"id": "Збір з користування та надання послуг стільникового рухомого зв'язку","value": 20.18,"size": "451408600","group": "2","index": 41,"x": 552.619815596905,"y": 59.062830605030804,"vy": 0.000024503247051774026,"vx": 0.00007365582684367659},
        {"id": "Надходження від плати за послуги, що надаються бюджетними установами згідно із законодавством","value": 8.28,"size": "2765559600","group": "2","index": 42,"x": 458.2535334564048,"y": 125.73022392696203,"vy": 0.000029337869788507217,"vx": 0.00003246210758909769},
        {"id": "Надходження до Державного спеціалізованого фонду фінансування загальнодержавних витрат на авіаційну діяльність та участь України у міжнародних авіаційних організаціях","value": 17.01,"size": "62800000","group": "2","index": 43,"x": 530.5916448924738,"y": 122.41771354187412,"vy": 0.000019593291980394405,"vx": 0.000003999794892791232}
    ]
    ];
        
        function type(d) {
            if (!d.value) return;
            d.value = +d.value;
            return d;
        }  
        function beeChart (json,divid,w) {
    
            if (w < 600) {
                var width = w-10
                var height = 560
            } else {
                var width = 600
                var height = 400
            }
            d3.select("#bee"+divid).html('')
            var bee = d3.select("#bee"+divid)
                .append("svg")
                .attr("width", width)
                .attr("height", height);
    
            if (divid=='2') {
                var domain = [1350, 90462669500]
                bee.append("circle").attr("cx",10).attr("cy",14).attr("r", 6).style("fill", "#006064")
                bee.append("circle").attr("cx",10).attr("cy",30).attr("r", 6).style("fill", "#f9a825")
                bee.append("circle").attr("cx",10).attr("cy",46).attr("r", 6).style("fill", "#ad1457")
                bee.append("circle").attr("cx",10).attr("cy",61).attr("r", 6).style("fill", "#512da8")
                bee.append("circle").attr("cx",140).attr("cy",14).attr("r", 6).style("fill", "#1976d2")
                bee.append("circle").attr("cx",140).attr("cy",30).attr("r", 6).style("fill", "#0097a7")
                bee.append("circle").attr("cx",140).attr("cy",46).attr("r", 6).style("fill", "#e57373")
    
                bee.append("text").attr("x", 20).attr("y", 19).text("Министерства").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 20).attr("y", 35).text("Силовики").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 20).attr("y", 51).text("Суд").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 20).attr("y", 67).text("ОГА").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 150).attr("y", 19).text("Агентства").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 150).attr("y", 35).text("Академии").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 150).attr("y", 51).text("Другое").style("font-size", "14px").attr("alignment-baseline","left")
            } else {
                var domain = [10000, 35841139000]
                bee.append("circle").attr("cx",10).attr("cy",14).attr("r", 6).style("fill", "#006064")
                bee.append("circle").attr("cx",10).attr("cy",30).attr("r", 6).style("fill", "#f9a825")
                bee.append("text").attr("x", 20).attr("y", 19).text("Налоговые").style("font-size", "14px").attr("alignment-baseline","left")
                bee.append("text").attr("x", 20).attr("y", 35).text("Неналоговые").style("font-size", "14px").attr("alignment-baseline","left")
    
            }
            
    
            var marginCh = {top: 40, right: 40, bottom: 40, left: 40},
                widthCh = width - marginCh.left - marginCh.right,
                heightCh = height - marginCh.top - marginCh.bottom;
            if (window.innerWidth < 600) {
                var marginCh = {top: 90, right: 40, bottom: 10, left: 120}
            }
            var formatValue = d3.format(",d");
    
            var xCh = d3.scaleLog()
                .rangeRound([0, widthCh]);
            
            var size = d3.scaleLinear()
                .domain(domain)
                .range([8,28]) 
            var g = bee.append("g")
                .attr("transform", "translate(" + marginCh.left + "," + marginCh.top + ")");
            var color = d3.scaleOrdinal()
                .domain([1, 2, 3, 4,5,6,7])
                .range(["#006064", "#f9a825", "#ad1457", '#512da8', "#1976d2", "#0097a7", '#e57373']);
    
            var data = json;
    
            xCh.domain(d3.extent(data, function(d) { return d.value; }));
    
            var tooltipBee = d3.select("body")
                .append("div")
                .style("position", "absolute")
                .style("z-index", "10")
                .style("visibility", "hidden")
                .style("padding", "14px")
                .style("background-color", "#f5f5f5")
                .style("color", "black")
                .style("border-radius", "6px")
                .style("border-color", "black")
                .style("font", "12px sans-serif")
                .text("tooltip");
            var simulationBee = d3.forceSimulation(data)
                .force('charge', d3.forceManyBody().strength(.1))
                .force("x", d3.forceX(function(d) { return xCh(d.value); }).strength(1))
                .force("y", d3.forceY( function (d) {
                    if (window.innerWidth < 600) {
                        return heightCh / 7.5;
                    } else {
                        return heightCh / 2;
                    }}))
                .force('collision', d3.forceCollide().radius(function(d) {
                    return size(d.size);
                }));
    
            
            for (var i = 0; i < 142; ++i) simulationBee.tick();
            
            if (window.innerWidth > 600) {
                g.append("g")
                    .attr("class", "axis axis--x")
                    .attr("transform", "translate(0," + heightCh + ")")
                    .style('font','10px sans-serif')
                    .call(d3.axisBottom(xCh)
                        .tickValues([1,5, 10, 20, 40, 70, 130, 600])
                        .tickFormat(d3.format(",.0f"))
                );
            }
    
            var cell = g.append("g")
                .attr("class", "cells")
                .attr('fill','none')
                .selectAll("g").data(d3.voronoi()
                    .extent([[-marginCh.left, -marginCh.top], [widthCh + marginCh.right, heightCh + marginCh.top]])
                    .x(function(d) { return d.x; })
                    .y(function(d) { return d.y; })
                .polygons(data)).enter().append("g");
    
            cell.append("circle")
                .style("fill", function(d){ return color(d.data.group)})
                .style("fill-opacity", 0.8)
                .attr("stroke", "black")
                .style("stroke-width", 2)
                .attr("r", function(d) {return size(d.data.size)})
                .attr("cx", function(d) { //return d.data.y; 
                    if (window.innerWidth < 600) {
                        return d.data.y; 
                    } else {
                        return d.data.x; 
                    }
                })
                .attr("cy", function(d) { //return d.data.x; 
                    if (window.innerWidth < 600) {
                        return d.data.x; 
                    } else {
                        return d.data.y; 
                    }
                });
    
            cell
                .on("mouseover", function(d) {
                    var change = d.data.value
                    var size = d.data.size / 1000000000
                    if (change > 0) {
                        var color = 'green'
                    } else if (change == 0) {
                        var color = 'grey'
                    } else {
                        var color = 'red'
                    }
                    tooltipBee.html("<h4>"+d.data.id + "</h4>"+
                    '<p>Дельта с прошлогодним бюджетом: <b style="color: '+color+'">'+change+'%</b></p>'
                    )
                    tooltipBee.style("visibility", "visible");
                })
                .on("mousemove", function() {
                    return tooltipBee.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
                })
                .on("mouseout", function(){return tooltipBee.style("visibility", "hidden");});
    
            cell.append("path")
                .attr("d", function(d) { return "M" + d.join("L") + "Z"; });
        }
    
    
        beeChart(beedata[0],'2',window.innerWidth);
        beeChart(beedata[1],'1',window.innerWidth);
        bubbleChart(bubblechartdata[0], 'expences',window.innerWidth);
        bubbleChart(bubblechartdata[1], 'revenue',window.innerWidth);
        window.onresize = function(event) {
            beeChart(beedata[0],'2',window.innerWidth);
            beeChart(beedata[1],'1',window.innerWidth);
            bubbleChart(bubblechartdata[0], 'expences',window.innerWidth);
            bubbleChart(bubblechartdata[1], 'revenue',window.innerWidth);
        };
        