const range = (start, stop, step = 1) =>
            Array(Math.ceil((stop - start) / step)).fill(start).map((x, y) => x + y * step)
        function makeDomain(min, max, step) {
            return range(min, max, max/step)
        }
        
        function makeChoroplethMap(id,w,index) {
    if (w < 760) {
        var width = w,
        height = w/1.3,
        scale = w*4.4,
        from = 260827968,
        to = 14;
    } else {
        var width = 760,
        scale = 3300,
        from = 260827968,
        to = 18,
        height = 500;
    }

    var albersProjection = d3.geoAlbers()
        .scale(scale)
        .rotate([-30.68,0])
        .center([0, 50.12])
        .translate( [width/2.2,height/3] );

    var geoPath = d3.geoPath()
        .projection(albersProjection);
    
    d3.select("#map"+index).html('')
    
    var svg = d3.select("#map"+index).append("svg")
        .attr("width", width)
        .attr("height", height);
        if (width > 500) {
            var fontSize = '18px'
            var textFontSize = '10px'
        } else {
            var fontSize = '12px'
            var textFontSize = '8px'
        }
    svg.append("text")
        .attr("x", (width / 2) ) 
        .attr("y", 20)
        .attr("text-anchor", "middle")  
        .style("font-size", fontSize)
        .style("font-family", "sans-serif")
        .style("text-transform", "uppercase")
        .text(id);
    var g = svg.append("g");
    
    var tooltipBee = d3.select("body")
        .append("div")
        .style("position", "absolute")
        .style("z-index", "10")
        .style("visibility", "hidden")
        .style("padding", "14px")
        .style("background-color", "white")
        .style("border", "1px solid #f5f5f5")
        .style("color", "black")
        .style("border-radius", "6px")
        .style("border-color", "black")
        .style("font", "12px sans-serif")
        .text("tooltip");
        
    var json = [{"region":"Вінницька область", "Накопичені відходи, кг":125944, "Використані засоби інд. захисту, кг":83652,"Відходи, що утилізовані у лікувальних закладах, кг":18985,"Відходи, передані компаніям утилізаторам, кг":105407,"Залишки відходів у лікувальному закладі, кг":1552},
{"region":"Волинська область", "Накопичені відходи, кг":80094.8, "Використані засоби інд. захисту, кг":49014.7,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":73861.4,"Залишки відходів у лікувальному закладі, кг":6233.4},
{"region":"Дніпропетровська область", "Накопичені відходи, кг":372693.286, "Використані засоби інд. захисту, кг":191677.857,"Відходи, що утилізовані у лікувальних закладах, кг":125.9,"Відходи, передані компаніям утилізаторам, кг":349102.747,"Залишки відходів у лікувальному закладі, кг":23464.639},
{"region":"Донецька область", "Накопичені відходи, кг":211279, "Використані засоби інд. захисту, кг":323429,"Відходи, що утилізовані у лікувальних закладах, кг":3242,"Відходи, передані компаніям утилізаторам, кг":189987,"Залишки відходів у лікувальному закладі, кг":18050},
{"region":"Житомирська область", "Накопичені відходи, кг":105733.3, "Використані засоби інд. захисту, кг":97784.6,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":96328.1,"Залишки відходів у лікувальному закладі, кг":9405.2},
{"region":"Закарпатська область", "Накопичені відходи, кг":362420.91, "Використані засоби інд. захисту, кг":127689.345,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":350245.83,"Залишки відходів у лікувальному закладі, кг":12175.08},
{"region":"Запорізька область", "Накопичені відходи, кг":413148.607, "Використані засоби інд. захисту, кг":316990.924,"Відходи, що утилізовані у лікувальних закладах, кг":1866.8,"Відходи, передані компаніям утилізаторам, кг":309845.845,"Залишки відходів у лікувальному закладі, кг":101435.962},
{"region":"Івано-Франківська область", "Накопичені відходи, кг":19963.81, "Використані засоби інд. захисту, кг":13805,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":19645.6,"Залишки відходів у лікувальному закладі, кг":318.21},
{"region":"Київська область", "Накопичені відходи, кг":232756.54, "Використані засоби інд. захисту, кг":127066.7,"Відходи, що утилізовані у лікувальних закладах, кг":35893.9,"Відходи, передані компаніям утилізаторам, кг":174911.5,"Залишки відходів у лікувальному закладі, кг":21951.14},
{"region":"Кіровоградська область", "Накопичені відходи, кг":35100.8, "Використані засоби інд. захисту, кг":27977.4,"Відходи, що утилізовані у лікувальних закладах, кг":3624,"Відходи, передані компаніям утилізаторам, кг":30861.4,"Залишки відходів у лікувальному закладі, кг":615.4},
{"region":"Луганська область", "Накопичені відходи, кг":28226.22, "Використані засоби інд. захисту, кг":9701.47,"Відходи, що утилізовані у лікувальних закладах, кг":4601.29,"Відходи, передані компаніям утилізаторам, кг":13108.49,"Залишки відходів у лікувальному закладі, кг":10516.44},
{"region":"Львівська область", "Накопичені відходи, кг":173103.58, "Використані засоби інд. захисту, кг":115962.95,"Відходи, що утилізовані у лікувальних закладах, кг":26348.4,"Відходи, передані компаніям утилізаторам, кг":139538.28,"Залишки відходів у лікувальному закладі, кг":7216.9},
{"region":"Миколаївська область", "Накопичені відходи, кг":4297609, "Використані засоби інд. захисту, кг":84006,"Відходи, що утилізовані у лікувальних закладах, кг":29644,"Відходи, передані компаніям утилізаторам, кг":4248725,"Залишки відходів у лікувальному закладі, кг":19240},
{"region":"Одеська область", "Накопичені відходи, кг":283190.73, "Використані засоби інд. захисту, кг":189936.87,"Відходи, що утилізовані у лікувальних закладах, кг":9770.2,"Відходи, передані компаніям утилізаторам, кг":254128.6,"Залишки відходів у лікувальному закладі, кг":19291.93},
{"region":"Полтавська область", "Накопичені відходи, кг":118964.16, "Використані засоби інд. захисту, кг":97578.78,"Відходи, що утилізовані у лікувальних закладах, кг":170,"Відходи, передані компаніям утилізаторам, кг":110958.16,"Залишки відходів у лікувальному закладі, кг":7836},
{"region":"Рівненська область", "Накопичені відходи, кг":70681.2, "Використані засоби інд. захисту, кг":45832,"Відходи, що утилізовані у лікувальних закладах, кг":5011.2,"Відходи, передані компаніям утилізаторам, кг":62261.9,"Залишки відходів у лікувальному закладі, кг":3408.1},
{"region":"Сумська область", "Накопичені відходи, кг":122667.732, "Використані засоби інд. захисту, кг":54280.084,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":99376.902,"Залишки відходів у лікувальному закладі, кг":23290.83},
{"region":"Тернопільська область", "Накопичені відходи, кг":25503, "Використані засоби інд. захисту, кг":19740,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":24228,"Залишки відходів у лікувальному закладі, кг":1275},
{"region":"Харківська область", "Накопичені відходи, кг":706154.62, "Використані засоби інд. захисту, кг":498998.62,"Відходи, що утилізовані у лікувальних закладах, кг":49759.17,"Відходи, передані компаніям утилізаторам, кг":634730.56,"Залишки відходів у лікувальному закладі, кг":21664.89},
{"region":"Херсонська область", "Накопичені відходи, кг":125346.42, "Використані засоби інд. захисту, кг":64710.8,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":99376.6,"Залишки відходів у лікувальному закладі, кг":25969.82},
{"region":"Хмельницька область", "Накопичені відходи, кг":113171.132, "Використані засоби інд. захисту, кг":69131.3,"Відходи, що утилізовані у лікувальних закладах, кг":7326.9,"Відходи, передані компаніям утилізаторам, кг":95948.132,"Залишки відходів у лікувальному закладі, кг":9896.1},
{"region":"Черкаська область", "Накопичені відходи, кг":49720, "Використані засоби інд. захисту, кг":19136,"Відходи, що утилізовані у лікувальних закладах, кг":21425,"Відходи, передані компаніям утилізаторам, кг":28130,"Залишки відходів у лікувальному закладі, кг":165},
{"region":"Чернівецька область", "Накопичені відходи, кг":148855.5, "Використані засоби інд. захисту, кг":87645,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":140777.5,"Залишки відходів у лікувальному закладі, кг":8078},
{"region":"Чернігівська область", "Накопичені відходи, кг":101694.8, "Використані засоби інд. захисту, кг":71732.3,"Відходи, що утилізовані у лікувальних закладах, кг":0,"Відходи, передані компаніям утилізаторам, кг":52077.3,"Залишки відходів у лікувальному закладі, кг":49617.5},
{"region":"м.Київ", "Накопичені відходи, кг":2811110.05, "Використані засоби інд. захисту, кг":191280.7,"Відходи, що утилізовані у лікувальних закладах, кг":4622.4,"Відходи, передані компаніям утилізаторам, кг":2805282.1,"Залишки відходів у лікувальному закладі, кг":1205.55}]   
    function makeColorRange(id) {
        return json.map(d => parseInt(d[id]))
    }
    var vax_values = makeColorRange(id)
    var color = d3.scaleThreshold()
        .domain(
            makeDomain(d3.min(vax_values),d3.max(vax_values),8)
        )
        .range(["rgb(247,252,253)","rgb(229,245,249)","rgb(204,236,230)","rgb(153,216,201)","rgb(102,194,164)","rgb(65,174,118)","rgb(35,139,69)","rgb(0,109,44)","rgb(0,68,27)"]);

    var colorText = d3.scaleThreshold()
        .domain(
            makeDomain(d3.min(vax_values),d3.max(vax_values),8)
        )
        .range(["rgb(0,68,27)","rgb(0,109,44)","rgb(35,139,69)","rgb(65,174,118)","rgb(62,88,82)","rgb(153,216,201)","rgb(204,236,230)","rgb(229,245,249)","rgb(247,252,253)"])
    
    g.selectAll("path")
        .data(ukraine.features)
        .enter()
        .append("path")
        .attr("fill", function(d) {
            if (d.properties.name == 'Автономна Республіка Крим'){
                return '#cecece'
            } else {
                var items = json.filter(k => k.region == d.properties.name)
                if (items.length != 0) {
                    var value = items[0][id]
                    return color(value)
                } else {
                    return '#cecece'
                }
            }
        })
        .attr("stroke", "#f5f5f5")
        .attr("stroke-width", ".1px")
        .attr("d", geoPath )
        .attr("class", "district")
        .on("mouseover", function(d) {
            if (d.properties.name == 'Автономна Республіка Крим'){
                tooltipBee.html(
                    '<h4>'+d.properties['name:ru']+'</h4><p>Временно оккупированная территория РФ</p>'
                )
            } else {
                var items = json.filter(k => k.region == d.properties.name)
                
                var html = '<h4>'+d.properties['name:ru']+'</h4><p>'+numberWithSpaces(items[0][id])
                tooltipBee.html(html)
            }
            var dist = d3.select(this)
            dist.attr("stroke", "#2c3555")
                .attr("stroke-width", "1.5px")
            return tooltipBee.style("visibility", "visible")
        })
        .on("mousemove", function() {
            return tooltipBee.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
        })
        .on("mouseout", function(d){
            var dist = d3.select(this)
            dist.attr("stroke", "#2c3555")
                .attr("stroke-width", ".1px")
            return tooltipBee.style("visibility", "hidden");
        })
    g.selectAll("text")
        .data(ukraine.features)
        .enter()
        .append("svg:text")
        .html(function(d,i){
            if (d.properties.name != 'Автономна Республіка Крим'){
                var items = json.filter(k => k.region == d.properties.name)
                if (items.length != 0) {
                    var value = items[0][id]
                    return numberWithSpaces(Math.round(value))
                }
            } 
        })
        .attr("x", function(d){
            return geoPath.centroid(d)[0];
        })
        .attr("y", function(d){
            if (d.properties['name:ru'] != 'Киевская область') {
                return geoPath.centroid(d)[1]+5;
            } else {
                return geoPath.centroid(d)[1]+20;
            }
            
        })
        .attr("text-anchor","middle")
        .attr('font-family','sans-serif')
        .attr('fill',function(d) {
            if (d.properties.name == 'Автономна Республіка Крим'){
                return 'white'
            } else {
                var items = json.filter(k => k.region == d.properties.name)
                if (items.length != 0) {
                    var value = items[0][id]
                    return colorText(value)
                }        
            } 
        })
        .attr('opacity','.9')
        .attr("font-size",textFontSize)
        
        //}
}
        function numberWithSpaces(x) {
            return x.toString().replace(/\B(?=(\d{3})+(?!\d))/g, " ");
        }
        function getData(id){
            var value = $.ajax({ 
                url: id+'.json', 
                async: false
            }).responseJSON;
            return value;
        }
        var ukraine = getData('https://cdn.jsdelivr.net/gh/liga-net/few-projects/local_elections/ukraine');

        var names = ["Накопичені відходи, кг","Використані засоби інд. захисту, кг","Відходи, що утилізовані у лікувальних закладах, кг","Відходи, передані компаніям утилізаторам, кг","Залишки відходів у лікувальному закладі, кг"]
        names.forEach(function(value,index) {
            makeChoroplethMap(value,window.innerWidth,index)
        })
        
    window.onresize = function(event) { 
        names.forEach(function(value,index) {
            makeChoroplethMap(value,window.innerWidth,index)
        })
    };