if(document.createStyleSheet) {
    document.createStyleSheet('https://cdn.jsdelivr.net/gh/liga-net/few-projects/russian_sanctions/russian_sanctions1.css');  
} else {
    var styles = "@import url('https://cdn.jsdelivr.net/gh/liga-net/few-projects/russian_sanctions/russian_sanctions1.css');";
    var newSS=document.createElement('link');
    newSS.rel='stylesheet';
    newSS.href='data:text/css,'+escape(styles);
    document.getElementsByTagName("head")[0].appendChild(newSS);
}
var companiesData = [
        {"id": "c1", "name": "ADM", "ind": "Агро", "desc": "продолжает важные операции"},
{"id": "c2", "name": "Colgate-Palmolive", "ind": "Одежда и бытовые товары", "desc": "продолжает важные операции"},
{"id": "c3", "name": "Cummins", "ind": "Промышленное оборудование, производство", "desc": "продолжает важные операции"},
{"id": "c4", "name": "Lamb Weston", "ind": "Агро", "desc": "продолжает работу"},
{"id": "c5", "name": "Cargill", "ind": "Агро", "desc": "продолжает работу"},
{"id": "c6", "name": "Pirelli", "ind": "Автомобили", "desc": "продолжает работу"},
{"id": "c7", "name": "Linde", "ind": "Химия, фарма", "desc": "продолжает работу"},
{"id": "c8", "name": "Nalco", "ind": "Химия, фарма", "desc": "продолжает работу"},
{"id": "c9", "name": "Air liquide", "ind": "Химия, фарма", "desc": "продолжает работу"},
{"id": "c10", "name": "Air Products", "ind": "Химия, фарма", "desc": "продолжает работу"},
{"id": "c11", "name": "Natura and Company", "ind": "Одежда и бытовые товары", "desc": "продолжает работу"},
{"id": "c12", "name": "Oriflame", "ind": "Одежда и бытовые товары", "desc": "продолжает работу"},
{"id": "c13", "name": "Rockwool", "ind": "Одежда и бытовые товары", "desc": "продолжает работу"},
{"id": "c14", "name": "Baker Tilley", "ind": "Консалтинг", "desc": "продолжает работу"},
{"id": "c15", "name": "Cloudflare", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "продолжает работу"},
{"id": "c17", "name": "Citrix", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "продолжает работу"},
{"id": "c18", "name": "Asus", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "продолжает работу"},
{"id": "c19", "name": "Gruma", "ind": "Еда и напитки", "desc": "продолжает работу"},
{"id": "c20", "name": "Robert Bosch GmbH", "ind": "Промышленное оборудование, производство", "desc": "продолжает работу"},
{"id": "c21", "name": "Koch Industries", "ind": "Промышленное оборудование, производство", "desc": "продолжает работу"},
{"id": "c22", "name": "Greif", "ind": "Промышленное оборудование, производство", "desc": "продолжает работу"},
{"id": "c23", "name": "IPG Photonics", "ind": "Промышленное оборудование, производство", "desc": "продолжает работу"},
{"id": "c24", "name": "Mettler Toledo", "ind": "Промышленное оборудование, производство", "desc": "продолжает работу"},
{"id": "c25", "name": "Dentsu International", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c26", "name": "Omnicom Media Group", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c27", "name": "BBDO Group", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c28", "name": "DDB", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c29", "name": "Leo Burnett", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c30", "name": "Authentic Brands Group", "ind": "Медиа, развлечения, реклама", "desc": "продолжает работу"},
{"id": "c31", "name": "Halliburton", "ind": "Нефть, газ, бензин", "desc": "продолжает работу"},
{"id": "c32", "name": "Baker Hughes", "ind": "Нефть, газ, бензин", "desc": "продолжает работу"},
{"id": "c33", "name": "Schlumberger", "ind": "Нефть, газ, бензин", "desc": "продолжает работу"},
{"id": "c34", "name": "International Paper", "ind": "Другое", "desc": "продолжает работу"},
{"id": "c35", "name": "Accor", "ind": "Недвижимость, рестораны, туризм", "desc": "продолжает работу"},
{"id": "c36", "name": "Focus Brands", "ind": "Недвижимость, рестораны, туризм", "desc": "продолжает работу"},
{"id": "c37", "name": "Subway", "ind": "Недвижимость, рестораны, туризм", "desc": "продолжает работу"},
{"id": "c38", "name": "Auchan", "ind": "Ритейл и e-commerce", "desc": "продолжает работу"},
{"id": "c39", "name": "Decathlon", "ind": "Ритейл и e-commerce", "desc": "продолжает работу"},
{"id": "c40", "name": "Leroy Merlin", "ind": "Ритейл и e-commerce", "desc": "продолжает работу"},
{"id": "c41", "name": "Metro", "ind": "Ритейл и e-commerce", "desc": "продолжает работу"},
{"id": "c42", "name": "Baker McKenzie", "ind": "Консалтинг", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c43", "name": "Dentons", "ind": "Консалтинг", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c44", "name": "Sidley Austin LLP", "ind": "Консалтинг", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c45", "name": "White & Case", "ind": "Консалтинг", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c46", "name": "Sidney Austin", "ind": "Консалтинг", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c47", "name": "Roku", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c48", "name": "DirecTV", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c49", "name": "Twitter", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c50", "name": "Youtube", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c51", "name": "TripAdvisor", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает услуги для всех кремлевских структур"},
{"id": "c52", "name": "Asian Infrastructure Investment Bank", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c53", "name": "Bank of China", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c54", "name": "BlackRock", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c55", "name": "BNP Paribas SA", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c56", "name": "Credit Suisse", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c57", "name": "HSBC", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c58", "name": "ICBC", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c59", "name": "ING Group", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c60", "name": "Intercontinental Exchange", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c61", "name": "JPMorgan", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c62", "name": "London Stock Exchange Group", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c63", "name": "MSCI", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c64", "name": "Nasdaq", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c65", "name": "New Development Bank", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c66", "name": "Rabobank", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c67", "name": "S&P", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c68", "name": "Societe Generale", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c69", "name": "State Street Corporation", "ind": "Финансы", "desc": "ограничивает доступ России к рынкам капитала"},
{"id": "c70", "name": "Goldman Sachs", "ind": "Финансы", "desc": "вывезла часть сотрудников из России"},
{"id": "c71", "name": "Bunge Limited", "ind": "Агро", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c72", "name": "Nestle", "ind": "Агро", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c73", "name": "Continental AG", "ind": "Автомобили", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c74", "name": "Abbvie", "ind": "Химия, фарма", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c75", "name": "Merck & Co.", "ind": "Химия, фарма", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c76", "name": "Pfizer", "ind": "Химия, фарма", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c77", "name": "GlaxoSmithKline", "ind": "Химия, фарма", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c78", "name": "Johnson & Johnson", "ind": "Химия, фарма", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c79", "name": "Mango", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c80", "name": "Swatch", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c81", "name": "Unilever", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c82", "name": "Abbott Labs", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c83", "name": "Whirlpool", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c84", "name": "Crocs", "ind": "Одежда и бытовые товары", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c85", "name": "Freshfields", "ind": "Консалтинг", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c86", "name": "DLA Piper", "ind": "Консалтинг", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c87", "name": "Skadden", "ind": "Консалтинг", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c88", "name": "Amadeus IT group", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c89", "name": "AMD", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c90", "name": "IBM", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c91", "name": "Intel", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c92", "name": "Sabre", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c93", "name": "Thermo Fisher", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c94", "name": "Bain", "ind": "Финансы", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c95", "name": "Brown-Forman", "ind": "Еда и напитки", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c96", "name": "Coca-Cola", "ind": "Еда и напитки", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c97", "name": "PepsiCo", "ind": "Еда и напитки", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c98", "name": "Mondelez-Nabisco", "ind": "Еда и напитки", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c99", "name": "Nokian Tyres", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c100", "name": "Publicis Group", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c101", "name": "Meta Platforms", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c102", "name": "Snap Inc.", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c103", "name": "The Washington Post", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c104", "name": "Exxon", "ind": "Нефть, газ, бензин", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c105", "name": "Coinbase", "ind": "Другое", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c106", "name": "WeWork", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c107", "name": "McDonald's", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c108", "name": "Amazon", "ind": "Ритейл и e-commerce", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c109", "name": "World Boxing Council", "ind": "Спорт", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c110", "name": "Scandinavian Tobacco", "ind": "Табак", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c111", "name": "Airbus", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c112", "name": "Boeing", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c113", "name": "Delta", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает определенные (или подразумеваемые все) операции"},
{"id": "c114", "name": "General Mills", "ind": "Агро", "desc": "приостанавливает новые инвестиции"},
{"id": "c115", "name": "Dow", "ind": "Химия, фарма", "desc": "приостанавливает новые инвестиции"},
{"id": "c116", "name": "AmerisourceBergen", "ind": "Химия, фарма", "desc": "приостанавливает новые инвестиции"},
{"id": "c117", "name": "Henkel", "ind": "Одежда и бытовые товары", "desc": "приостанавливает новые инвестиции"},
{"id": "c118", "name": "Procter & Gamble", "ind": "Одежда и бытовые товары", "desc": "приостанавливает новые инвестиции"},
{"id": "c119", "name": "Reckitt Benckiser Group", "ind": "Одежда и бытовые товары", "desc": "приостанавливает новые инвестиции"},
{"id": "c120", "name": "Coty, Inc", "ind": "Одежда и бытовые товары", "desc": "приостанавливает новые инвестиции"},
{"id": "c121", "name": "Kimberly-Clark", "ind": "Одежда и бытовые товары", "desc": "приостанавливает новые инвестиции"},
{"id": "c122", "name": "Allen & Overy", "ind": "Консалтинг", "desc": "приостанавливает новые инвестиции"},
{"id": "c123", "name": "ADP", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает новые инвестиции"},
{"id": "c124", "name": "Sony", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает новые инвестиции"},
{"id": "c125", "name": "Lumen Technologies", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает новые инвестиции"},
{"id": "c126", "name": "Allianz", "ind": "Финансы", "desc": "приостанавливает новые инвестиции"},
{"id": "c127", "name": "Remitly Global", "ind": "Финансы", "desc": "приостанавливает новые инвестиции"},
{"id": "c128", "name": "Carlsberg Group", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c129", "name": "Danone", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c130", "name": "Kraft Heinz", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c131", "name": "Savills plc", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c132", "name": "Yum Brands", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c133", "name": "Mars, Incorporated", "ind": "Еда и напитки", "desc": "приостанавливает новые инвестиции"},
{"id": "c134", "name": "BASF SE", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает новые инвестиции"},
{"id": "c135", "name": "Siemens", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает новые инвестиции"},
{"id": "c136", "name": "Otis Worldwide", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает новые инвестиции"},
{"id": "c137", "name": "Arconic", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает новые инвестиции"},
{"id": "c138", "name": "Mohawk Industries", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает новые инвестиции"},
{"id": "c139", "name": "Disney", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает новые инвестиции"},
{"id": "c140", "name": "Paramount Pictures Corporation", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает новые инвестиции"},
{"id": "c141", "name": "WarnerMedia", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает новые инвестиции"},
{"id": "c142", "name": "Norsk Hydro", "ind": "Металлы", "desc": "приостанавливает новые инвестиции"},
{"id": "c143", "name": "Trafigura", "ind": "Металлы", "desc": "приостанавливает новые инвестиции"},
{"id": "c144", "name": "Wintershall Dea AG", "ind": "Нефть, газ, бензин", "desc": "приостанавливает новые инвестиции"},
{"id": "c145", "name": "Siemens Energy AG", "ind": "Нефть, газ, бензин", "desc": "приостанавливает новые инвестиции"},
{"id": "c146", "name": "TotalEnergies", "ind": "Нефть, газ, бензин", "desc": "приостанавливает новые инвестиции"},
{"id": "c147", "name": "Uniper SE", "ind": "Нефть, газ, бензин", "desc": "приостанавливает новые инвестиции"},
{"id": "c148", "name": "Hyatt", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c149", "name": "Marriott", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c150", "name": "CBRE Group", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c151", "name": "Hines Interests Limited Partnership", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c152", "name": "Knight Frank", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c153", "name": "Hilton", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c154", "name": "Intercontinental Hotels", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c155", "name": "Dunkin Donuts", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает новые инвестиции"},
{"id": "c156", "name": "Japan Tobacco", "ind": "Табак", "desc": "приостанавливает новые инвестиции"},
{"id": "c157", "name": "Phillip Morris", "ind": "Табак", "desc": "приостанавливает новые инвестиции"},
{"id": "c158", "name": "Bombardier", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает новые инвестиции"},
{"id": "c159", "name": "AerCap", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает новые инвестиции"},
{"id": "c160", "name": "Aston Martin", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c161", "name": "Bentley", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c16", "name": "LG Electronics", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c162", "name": "GM", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c163", "name": "Honda", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c164", "name": "Jaguar", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c165", "name": "Mazda", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c166", "name": "Mercedes-Benz", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c167", "name": "Nissan", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c168", "name": "Subaru", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c169", "name": "Toyota", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c170", "name": "Volkswagen", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c171", "name": "Volvo", "ind": "Автомобили", "desc": "приостанавливает все поставки"},
{"id": "c172", "name": "Burberry", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c173", "name": "Canada Goose", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c174", "name": "H&M", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c175", "name": "Lego", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c176", "name": "Marks & Spencer", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c177", "name": "Puma", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c178", "name": "Under Armour", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c179", "name": "Ferragamo", "ind": "Одежда и бытовые товары", "desc": "приостанавливает все поставки"},
{"id": "c180", "name": "Canon", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c181", "name": "Ricoh", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c182", "name": "Xerox", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c183", "name": "Logitech", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c184", "name": "Dell", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c185", "name": "HP", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c186", "name": "Nokia", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c187", "name": "Samsung", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c188", "name": "TSMC", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c189", "name": "Ericsson", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает все поставки"},
{"id": "c190", "name": "Anheuser-Busch", "ind": "Еда и напитки", "desc": "приостанавливает все поставки"},
{"id": "c191", "name": "Budweiser Budvar", "ind": "Еда и напитки", "desc": "приостанавливает все поставки"},
{"id": "c192", "name": "Diageo", "ind": "Еда и напитки", "desc": "приостанавливает все поставки"},
{"id": "c193", "name": "Heineken", "ind": "Еда и напитки", "desc": "приостанавливает все поставки"},
{"id": "c194", "name": "Kellogg", "ind": "Еда и напитки", "desc": "приостанавливает все поставки"},
{"id": "c195", "name": "John Deere", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c196", "name": "Atlas Copco", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c197", "name": "DB Schenker", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c198", "name": "Global Foundries", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c199", "name": "Hitachi Construction", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c200", "name": "Komatsu", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c201", "name": "Metso Outotec", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c202", "name": "Bridgestone Tire", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c203", "name": "Iveco", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает все поставки"},
{"id": "c204", "name": "Mattel", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает все поставки"},
{"id": "c205", "name": "Herbalife", "ind": "Другое", "desc": "приостанавливает все поставки"},
{"id": "c206", "name": "ASOS (retailer)", "ind": "Ритейл и e-commerce", "desc": "приостанавливает все поставки"},
{"id": "c207", "name": "Boohoo Group", "ind": "Ритейл и e-commerce", "desc": "приостанавливает все поставки"},
{"id": "c208", "name": "eBay", "ind": "Ритейл и e-commerce", "desc": "приостанавливает все поставки"},
{"id": "c209", "name": "Farfetch", "ind": "Ритейл и e-commerce", "desc": "приостанавливает все поставки"},
{"id": "c210", "name": "YOOX", "ind": "Ритейл и e-commerce", "desc": "приостанавливает все поставки"},
{"id": "c211", "name": "Dassault Aviation", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c212", "name": "Rolls Royce Limited", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c213", "name": "CMA CGM", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c214", "name": "Hapag Lloyd", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c215", "name": "HMM", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c216", "name": "Maersk", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c217", "name": "Alstom", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c218", "name": "DHL", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c219", "name": "DSV", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c220", "name": "FedEx", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c221", "name": "Geodis", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c222", "name": "Kuehne + Nagel", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c223", "name": "MSC Cruises", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c224", "name": "United Parcel Service", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c225", "name": "UPS", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает все поставки"},
{"id": "c226", "name": "Grupo Bimbo", "ind": "Агро", "desc": "приостанавливает деятельность"},
{"id": "c227", "name": "Daimler Company", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c228", "name": "Ferrari", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c229", "name": "Ford", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c230", "name": "Harley-Davidson", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c231", "name": "Hyundai Group", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c232", "name": "Michelin Tire", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c233", "name": "Renault", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c234", "name": "Scania", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c235", "name": "Škoda Auto", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c236", "name": "Stellantis", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c237", "name": "Magna", "ind": "Автомобили", "desc": "приостанавливает деятельность"},
{"id": "c238", "name": "Adidas", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c239", "name": "Chanel", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c240", "name": "Hennes & Mauritz", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c241", "name": "Hermes", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c242", "name": "Inditex", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c243", "name": "JD Sports", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c244", "name": "Kering", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c245", "name": "L'Oreal", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c246", "name": "Levi Strauss & Co.", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c247", "name": "LVMH", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c248", "name": "Moncler", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c249", "name": "Nike Inc", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c250", "name": "Prada", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c251", "name": "PVH", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c252", "name": "Richemont", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c253", "name": "Rolex", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c254", "name": "Swarovski", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c255", "name": "The Estée Lauder Companies", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c256", "name": "Clorox", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c257", "name": "Amway", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c258", "name": "Signet Jewelers", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c259", "name": "Uniqlo/Fast Retailing", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c260", "name": "Samsonite", "ind": "Одежда и бытовые товары", "desc": "приостанавливает деятельность"},
{"id": "c261", "name": "Accenture", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c262", "name": "Aecom", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c263", "name": "BCG", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c264", "name": "Cleary Gottlieb", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c265", "name": "Clifford Chance", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c266", "name": "David Chipperfield Architects", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c267", "name": "Deloitte", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c268", "name": "Ernst & Young", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c269", "name": "Fieldfisher", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c270", "name": "Grant Thornton", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c271", "name": "Kearney (consulting firm)", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c272", "name": "KPMG", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c273", "name": "Linklaters", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c274", "name": "McKinsey", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c275", "name": "Moody's", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c276", "name": "MVRDV", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c277", "name": "Norton Rose Fulbright", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c278", "name": "Oliver Wyman", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c279", "name": "PwC", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c280", "name": "WPP plc", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c281", "name": "Zaha Hadid Architects", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c282", "name": "Akin Gump", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c283", "name": "Baker Botts", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c284", "name": "Bryan Cave", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c285", "name": "Debevoise & Plimpton", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c286", "name": "Dechert", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c287", "name": "Eversheds Sutherland", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c288", "name": "Herbert Smith", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c289", "name": "Hogan Lovells", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c290", "name": "Latham & Watkins", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c291", "name": "Morgan Lewis", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c292", "name": "Squire Patton Boggs", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c293", "name": "Marsh McLennan", "ind": "Консалтинг", "desc": "приостанавливает деятельность"},
{"id": "c294", "name": "Intuit", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c295", "name": "Coupa", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c296", "name": "Akamai", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c297", "name": "Juniper Networks", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c298", "name": "Leica Camera AG", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c299", "name": "Acronis", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c300", "name": "Stanley Black & Decker", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c301", "name": "Salesforce", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c302", "name": "Netscout", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c303", "name": "Adobe Inc.", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c304", "name": "Alphabet Inc.", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c305", "name": "Apple", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c306", "name": "Autodesk", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c307", "name": "Avid", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c308", "name": "Bumble", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c309", "name": "DXC Technology", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c310", "name": "EPAM Systems", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c311", "name": "Esri", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c312", "name": "Fortinet", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c313", "name": "Grammarly", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c314", "name": "Microsoft", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c315", "name": "Nvidia", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c316", "name": "Oracle", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c317", "name": "Panasonic", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c318", "name": "SAP", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c319", "name": "TikTok", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c320", "name": "Trimble", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c321", "name": "VMWare", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c322", "name": "Clarivate", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c323", "name": "EarthDaily Analytics", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c324", "name": "Cisco", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c325", "name": "Cogent Communications", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c326", "name": "Lumen", "ind": "Электроника, софт, хардвер, телекоммуникации", "desc": "приостанавливает деятельность"},
{"id": "c327", "name": "Deutsche Bank", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c328", "name": "American Express", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c329", "name": "Assicurazioni Generali", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c330", "name": "Mastercard", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c331", "name": "Payoneer", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c332", "name": "Paypal", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c333", "name": "Visa", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c334", "name": "Commerzbank", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c335", "name": "Fitch", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c336", "name": "Western Union", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c337", "name": "Adenza", "ind": "Финансы", "desc": "приостанавливает деятельность"},
{"id": "c338", "name": "Fazer", "ind": "Еда и напитки", "desc": "приостанавливает деятельность"},
{"id": "c339", "name": "Paulig", "ind": "Еда и напитки", "desc": "приостанавливает деятельность"},
{"id": "c340", "name": "Valio", "ind": "Еда и напитки", "desc": "приостанавливает деятельность"},
{"id": "c341", "name": "McCain Foods", "ind": "Еда и напитки", "desc": "приостанавливает деятельность"},
{"id": "c342", "name": "McCormick", "ind": "Еда и напитки", "desc": "приостанавливает деятельность"},
{"id": "c343", "name": "Caterpillar", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c344", "name": "GE", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c345", "name": "JCB", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c346", "name": "Rockwell Automation", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c347", "name": "Sandvik", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c348", "name": "Timken Company", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c349", "name": "3M", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c350", "name": "Avery Dennison", "ind": "Промышленное оборудование, производство", "desc": "приостанавливает деятельность"},
{"id": "c351", "name": "Interpublic Group", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c352", "name": "Activision Blizzard", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c353", "name": "BBC", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c354", "name": "Bloomberg", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c355", "name": "Deezer", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c356", "name": "Discovery, Inc", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c357", "name": "Electronic Arts", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c358", "name": "Live Nation Entertainment", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c359", "name": "Netflix", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c360", "name": "Nintendo", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c361", "name": "Radio Free Europe", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c362", "name": "Spotify", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c363", "name": "Take-Two Interactive", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c364", "name": "The New York Times", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c365", "name": "Universal", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c366", "name": "WWE", "ind": "Медиа, развлечения, реклама", "desc": "приостанавливает деятельность"},
{"id": "c367", "name": "Alcoa", "ind": "Металлы", "desc": "приостанавливает деятельность"},
{"id": "c368", "name": "Kinross Gold", "ind": "Металлы", "desc": "приостанавливает деятельность"},
{"id": "c369", "name": "BP", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c370", "name": "Eni", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c371", "name": "Equinor", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c372", "name": "Monroe Energy", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c373", "name": "Neste Oyj", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c374", "name": "OMV", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c375", "name": "Par Pacific Holdings", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c376", "name": "Preem", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c377", "name": "Shell", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c378", "name": "Valero Energy", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c379", "name": "Viva Energy", "ind": "Нефть, газ, бензин", "desc": "приостанавливает деятельность"},
{"id": "c380", "name": "Johnson Controls", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c381", "name": "Coursera", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c382", "name": "Louis Dreyfus", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c383", "name": "Sylvamo", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c384", "name": "Upwork", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c385", "name": "Vanguard", "ind": "Другое", "desc": "приостанавливает деятельность"},
{"id": "c386", "name": "Papa John's", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c387", "name": "Starbucks", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c388", "name": "Burger King", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c389", "name": "Airbnb", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c390", "name": "Booking", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c391", "name": "Carnival Corporation & plc", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c392", "name": "Expedia", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c393", "name": "Norwegian Cruise Lines", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c394", "name": "Oceania Cruises", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c395", "name": "Regent Seven Seas Cruises", "ind": "Недвижимость, рестораны, туризм", "desc": "приостанавливает деятельность"},
{"id": "c396", "name": "Mothercare", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c397", "name": "Asda", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c398", "name": "Canadian Tire", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c399", "name": "Ikea", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c400", "name": "J Sainsbury", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c401", "name": "JYSK", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c402", "name": "Morrisons", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c403", "name": "TJX companies", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c404", "name": "Waitrose", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c405", "name": "Estee Lauder", "ind": "Ритейл и e-commerce", "desc": "приостанавливает деятельность"},
{"id": "c406", "name": "Formula One", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c407", "name": "International Tennis Federation", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c408", "name": "NHL", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c409", "name": "Wise PLC", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c410", "name": "Women's Tennis Association", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c411", "name": "World Federation of Exchanges", "ind": "Спорт", "desc": "приостанавливает деятельность"},
{"id": "c412", "name": "Winston & Strawn", "ind": "Табак", "desc": "приостанавливает деятельность"},
{"id": "c413", "name": "Imperial Brands", "ind": "Табак", "desc": "приостанавливает деятельность"},
{"id": "c414", "name": "Honeywell", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c415", "name": "Raytheon", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c416", "name": "OneWeb", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c417", "name": "Alaska Airlines", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c418", "name": "American Airlines", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c419", "name": "Korean Air Lines", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c420", "name": "United Airlines", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c421", "name": "Bolt", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c422", "name": "Uber", "ind": "Транспорт, авиакомпании, аэрокосмическая отрасль", "desc": "приостанавливает деятельность"},
{"id": "c423", "name": "Eurovision", "ind": "Медиа, развлечения, реклама", "desc": "запрещает все российские соревнования"},
{"id": "c424", "name": "International Boxing Federation", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c425", "name": "International Cycling Union", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c426", "name": "International Ice Hockey Federation", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c427", "name": "International Skating Union", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c428", "name": "International Weightlifting Federation", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c429", "name": "The R&A", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c430", "name": "World Athletics Council", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c431", "name": "World Boxing Association", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c432", "name": "World Boxing Organization", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c433", "name": "World Rowing Federation", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c434", "name": "World Rugby Union", "ind": "Спорт", "desc": "запрещает все российские соревнования"},
{"id": "c435", "name": "FIFA", "ind": "Спорт", "desc": "запрещает российским спортсменам участвовать в соревнованиях"},
{"id": "c436", "name": "IOC", "ind": "Спорт", "desc": "запрещает российским спортсменам участвовать в соревнованиях"},
{"id": "c437", "name": "UEFA", "ind": "Спорт", "desc": "запрещает российским спортсменам участвовать в соревнованиях"},
{"id": "c438", "name": "International Cat Federation", "ind": "Спорт", "desc": "запрещает российским котам участвовать в соревнованиях"}
        ]
		
		var scrolly = d3.select("#scrolly");
		var figure = scrolly.select("figure");
		var article = scrolly.select("article");
		var step = article.selectAll(".step");

		
		var scroller = scrollama();

		
		function handleResize() {
			// 1. update height of step elements
			var stepH = Math.floor(window.innerHeight * 0.75);
			var figureHeight = window.innerHeight / 2;
			var figureMarginTop = (window.innerHeight - figureHeight) / 2;

			figure
				.style("height", figureHeight + "px")
				.style("top", figureMarginTop + "px");

			scroller.resize();
		}

		var textData = ["продолжает важные операции", "продолжает работу", "приостанавливает услуги для всех кремлевских структур", "ограничивает доступ России к рынкам капитала", "вывезла часть сотрудников из России", "приостанавливает определенные (или подразумеваемые все) операции", "приостанавливает новые инвестиции", "приостанавливает все поставки", "приостанавливает деятельность", "запрещает все российские соревнования", "запрещает российским спортсменам участвовать в соревнованиях", "запрещает российским котам участвовать в соревнованиях"]
		function handleStepEnter(response) {
			step.classed("is-active", function (d, i) {
				return i === response.index;
			});
			figure.select("p").text(textData[response.index]);
		}

		function setupStickyfill() {
			d3.selectAll(".sticky").each(function () {
				Stickyfill.add(this);
			});
		}

		function init() {
			setupStickyfill();

			handleResize();
			scroller
				.setup({
					step: "#scrolly article .step",
					offset: 0.33,
					debug: false
				})
				.onStepEnter(handleStepEnter);
		}

		
        function numberWithSpaces(x) {
            return x.toString().replace(/\B(?=(\d{3})+(?!\d))/g, " ");
        }
        function add(accumulator, a) {
            return accumulator + a;
        }
        var industriesData = [
        {"name": "Электроника, софт, хардвер, телекоммуникации", "value": 57},
        {"name": "Одежда и бытовые товары", "value": 46},
        {"name": "Консалтинг", "value": 43},
        {"name": "Медиа, развлечения, реклама", "value": 34},
        {"name": "Финансы", "value": 33},
        {"name": "Транспорт, авиакомпании, аэрокосмическая отрасль", "value": 29},
        {"name": "Промышленное оборудование, производство", "value": 29},
        {"name": "Автомобили", "value": 25},
        {"name": "Недвижимость, рестораны, туризм", "value": 24},
        {"name": "Спорт", "value": 22},
        {"name": "Еда и напитки", "value": 21},
        {"name": "Ритейл и e-commerce", "value": 20},
        {"name": "Нефть, газ, бензин", "value": 19},
        {"name": "Химия, фарма", "value": 11},
        {"name": "Агро", "value": 7},
        {"name": "Табак", "value": 5},
        {"name": "Металлы", "value": 4},
        {"name": "Другое", "value": 9}]
        horizontalBarChart(window.innerWidth,industriesData,'industries')
        //https://correctiv.github.io/ru-sanctions-dashboard/src/data/recent_origin_aggregation_table.csv
        d3.csv('https://cdn.jsdelivr.net/gh/liga-net/few-projects/russian_sanctions/recent_origin_aggregation_table.csv', function(data) {
            var countries = ['ar', 'au', 'ch', 'eu', 'gb', 'jp', "us"]
            //var countriesName = ['Argentina', 'Australia', 'Switzerland', 'EU', 'Great Britain', 'Japan', "USA"]
            var countriesName = ['Аргентина', 'Австралія', 'Швейцарія', 'ЕС', 'Велика Британія', 'Японія', "США"]
            var countriesValues = []
            var dataset = data.slice(1,)
            countries.forEach(function(country) {
                var countrySum = dataset.map(d => parseInt(d[country]))
                countrySum = countrySum.filter(d => isNaN(d) == false)
                countrySum = countrySum.reduce(add, 0)
                countriesValues.push(countrySum)
            })
            var imposing = []
            countriesValues.forEach(function(d,i) {
                imposing.push({'name':countriesName[i],'value':d})
            })
            imposing.sort(function(a, b) {
                return parseFloat(b.value) - parseFloat(a.value);
            });
            horizontalBarChart(window.innerWidth,imposing,'imposing')
        }) 
        //https://correctiv.github.io/ru-sanctions-dashboard/src/data/sanctions_timeline_2014-2022.csv
        d3.csv('https://cdn.jsdelivr.net/gh/liga-net/few-projects/russian_sanctions/sanctions_timeline_2014-2022.csv', function(data) {
            makeBarChart(window.innerWidth, data,'weeklyVax')
        })
        var locale = d3.timeFormatLocale({
            "dateTime": "%A, %e %B %Y г. %X",
            "date": "%d.%m.%Y",
            "time": "%H:%M:%S",
            "periods": ["AM", "PM"],
            "days": ["воскресенье", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота"],
            "shortDays": ["вс", "пн", "вт", "ср", "чт", "пт", "сб"],
            "months": ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"],
            "shortMonths": ["янв", "фев", "мар", "апр", "май", "июн", "июл", "авг", "сен", "окт", "ноя", "дек"]
        });
        function multiFormat(date) {
            return (d3.timeSecond(date) < date ? formatMillisecond
                : d3.timeMinute(date) < date ? formatSecond
                : d3.timeHour(date) < date ? formatMinute
                : d3.timeDay(date) < date ? formatHour
                : d3.timeMonth(date) < date ? (d3.timeWeek(date) < date ? formatDay : formatWeek)
                : d3.timeYear(date) < date ? formatMonth
                : formatYear)(date);
        }
        var formatMillisecond = locale.format(".%L"),
            formatSecond = locale.format(":%S"),
            formatMinute = locale.format("%I:%M"),
            formatHour = locale.format("%I %p"),
            formatDay = locale.format("%a %d"),
            formatWeek = locale.format("%d %b"),
            formatMonth = locale.format("%b %Y"),
            formatYear = locale.format("%Y");
        function makeBarChart(w,uploaded_data,id) {
            if (w>600) {
                var windowW = 600
            } else {
                var windowW = w-20
            }
            // set the dimensions and margins of the graph
            var margin = {top: 60, right: 30, bottom: 70, left: 60},
                width = windowW - margin.left - margin.right,
                height = 400 - margin.top - margin.bottom;
            
            // append the svg object to the body of the page
            d3.select("#"+id).html('')
            var svg = d3.select("#"+id)
            .append("svg")
                .attr("width", width + margin.left + margin.right)
                .attr("height", height + margin.top + margin.bottom)
            .append("g")
                .attr("transform",
                    "translate(" + margin.left + "," + margin.top + ")");
            if (width > 500) {
                var tickValue = 7
                var fontSize = '18px'
                var titleMargin = 0
            } else {
                var tickValue = 6
                var fontSize = '16px'
                var titleMargin = 20
            }
            
            svg.append("text")
                .attr("x", (width / 2) - titleMargin) 
                .attr("y", 0 - (margin.top / 1.5))
                .attr("text-anchor", "middle")  
                .style("font-size", fontSize)
                .style("font-family", "Georgia")
                .text('Количество санкций против России с 2014 года');
            svg.append("text")
                .attr("x", (width / 2) ) 
                .attr("y", -15)
                .attr("text-anchor", "middle")  
                .style("font-size", '12px')
                .style("fill", '#cecece')
                .style("font-family", "sans-serif")
                .text('Помесячно, с марта 2014 года по сегодня');  

        var parseDate = d3.timeParse("%Y-%m-%d");
        var formatDay = locale.format("%m.%Y")
        var tickValues = uploaded_data.map(function(d) { return parseDate(d.start); }).filter(function(d,i) {
            if (i % 15 == 1) {
                return d
            }
        })
        var x = d3.scaleBand()
          .range([ 0, width ])
          .domain(uploaded_data.map(function(d) { return parseDate(d.start); }))
          .padding(0.2);

        svg.append("g")
          .attr("transform", "translate(0," + height + ")")
          .call(d3.axisBottom(x).tickValues(tickValues).tickFormat(formatDay))
          .selectAll("text")
            .style("text-anchor", "end");
        
        // Add Y axis
        var y = d3.scaleLinear()
          .domain([0, d3.max(uploaded_data.map(function(d) { return parseInt(d.sanction_id); }))])
          .range([ height, 0]);
        svg.append("g")
          .call(d3.axisLeft(y));
          var tooltipBee = d3.select("body")
                .append("div")
                .style("position", "absolute")
                .style("z-index", "10")
                .style("visibility", "hidden")
                .style("padding", "14px")
                .style("background-color", "white")
                .style("border", "1px solid #f5f5f5")
                .style("color", "black")
                .style("border-radius", "6px")
                .style("border-color", "black")
                .style("font", "12px sans-serif")
                .text("tooltip");
        
        svg.selectAll("mybar")
          .data(uploaded_data)
          .enter()
          .append("rect")
            .attr("x", function(d) { return x(parseDate(d.start)); })
            .attr("y", function(d) { return y(d.sanction_id); })
            .attr("width", x.bandwidth())
            .attr("height", function(d) { return height - y(d.sanction_id); })
            .attr("fill","#004d40")
            .on("mouseover", function(d,i) {
                tooltipBee.html("<h4>"+formatDay(parseDate(d.start))+'</h4><p>'+numberWithSpaces(d.sanction_id)+' санкций</p>')
                tooltipBee.style("visibility", "visible")
                })
            .on("mousemove", function() {
                return tooltipBee.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
            })
            .on("mouseout", function(d){
                return tooltipBee.style("visibility", "hidden");
            });
        } 
        
        function horizontalBarChart(w,data,id) {
            if (w < 600) {
                var start_width = w,
                left = 20;
            } else {
                var start_width = 600,
                left = 50
            } 
            if (id == 'imposing'){
                start_height = 400
                var left = 90;
                var title = "Кто вводит санкции?"
                var subtitle = "Количество новых санкций против России с 22 февраля 2022 г."
                var keys = ["value"]
                var colorPalette = ['#004d40','#72A3C9','#E74545']
            } else if (id == 'industries') {
                start_height = 600
                var left = 230;
                var title = "Чем занимались компании, ушедшие из России"
                var subtitle = ""
                var keys = ["value"]
                var colorPalette = ['#004d40','#72A3C9','#E74545']   
            }
            d3.select("#"+id).html('')
            
            var margin = {top: 50, right: 30, bottom: 20, left: left},
                width = start_width - margin.left - margin.right,
                height = start_height - margin.top - margin.bottom;
            
            if (width > 500) {
                var tickValue = 7
                var fontSize = '18px'
                var titleMargin = 0
            } else {
                var tickValue = 6
                var fontSize = '16px'
                var titleMargin = 20
            }
            var svg = d3.select("#"+id)
                .append("svg")
                .attr("width", width + margin.left + margin.right)
                .attr("height", height + margin.top + margin.bottom)
            .append("g")
                .attr("transform",
                    "translate(" + margin.left + "," + margin.top + ")");
                    
            svg.append("text")
                .attr("x", (width / 2) - titleMargin) 
                .attr("y", 0 - (margin.top / 1.5))
                .attr("text-anchor", "middle")  
                .style("font-size", fontSize)
                .style("font-family", "Georgia")
                .text(title);
            svg.append("text")
                .attr("x", (width / 2) ) 
                .attr("y", -15)
                .attr("text-anchor", "middle")  
                .style("font-size", '12px')
                .style("fill", '#cecece')
                .style("font-family", "sans-serif")
                .text(subtitle);  
            
                
            g = svg.append("g")
            var tooltipBee = d3.select("body")
                .append("div")
                .style("position", "absolute")
                .style("z-index", "10")
                .style("visibility", "hidden")
                .style("padding", "14px")
                .style("background-color", "white")
                .style("border", "1px solid #f5f5f5")
                .style("color", "black")
                .style("border-radius", "6px")
                .style("border-color", "black")
                .style("font", "12px sans-serif")
                .text("tooltip");

            var y = d3.scaleBand()
                .rangeRound([0, height])
                .paddingInner(0.05)
                .align(0.1);

            var x = d3.scaleLinear()
                .range([0, width]);

            var z = d3.scaleOrdinal()
                .range(colorPalette);

            y.domain(data.map(function(d) { return d.name; }));
            x.domain([0, d3.max(data, function(d) { return d.value; })]).nice();

            var ticks = [0, 10000]
            z.domain(keys);

            g.append("g")
                .selectAll("g")
                .data(d3.stack().keys(keys)(data))
                .enter().append("g")
                .attr("fill", function(d) { return z(d.key); })
                .selectAll("rect")
                .data(function(d) { return d; })
                .enter().append("rect")
                .attr("y", function(d) { return y(d.data.name); })
                .attr("x", function(d) { return x(d[0]); })
                .attr("width", function(d) { return x(d[1]) - x(d[0]); })
                .attr("height", y.bandwidth())
                .on("mouseover", function(d) {
                    var html = '<h4>'+d.data.name+'</h4><p>'+numberWithSpaces(d.data.value)+'</p>'
                    tooltipBee.html(html)
                    tooltipBee.style("visibility", "visible")
                    })
                .on("mousemove", function() {
                    return tooltipBee.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
                })
                .on("mouseout", function(d){
                    return tooltipBee.style("visibility", "hidden");
                })
            g.append("g")
                .selectAll("g")
                .data(d3.stack().keys(keys)(data))
                .enter()
                .selectAll("text")
                .data(function(d) { return d; })
                .enter().append("text")
                .text(function(d) {
                    return d.data.value
                })
                .attr("y", function(d) {;return y(d.data.name) + (y.bandwidth()/2+4); })
                .attr("x", function(d) { return x(d[1]) - x(d[0]) + 5; })
                .attr('fill','black')
                .attr('font-family','sans-serif')
                .attr('font-size','12px')

            g.append("g")
                .attr("class", "axis")
                .attr("transform", "translate(0,0)")
                .call(d3.axisLeft(y));
                
            svg.append("g")
                .attr("transform", "translate(0," + height + ")")
                .call(d3.axisBottom(x).ticks(5))
                .selectAll("text")
                .style("text-anchor", "middle");
            
        }
        
		init();
        var tooltipBee = d3.select("body")
                .append("div")
                .style("position", "absolute")
                .style("z-index", "10")
                .style("visibility", "hidden")
                .style("padding", "14px")
                .style("background-color", "white")
                .style("border", "1px solid #f5f5f5")
                .style("color", "black")
                .style("border-radius", "6px")
                .style("border-color", "black")
                .style("font", "12px sans-serif")
                .text("tooltip");
        d3.selectAll('.step p')
            .on("mouseover", function(d,i) {
                var company = companiesData.filter(x => x.id == this.id)[0]
                d3.select('figure p').text()
                tooltipBee.html('<p><b>'+company.name+'</b>: '+d3.select('figure p').text()+'</p>'+
                '<p>Отрасль: '+company.ind+'</p>')
                tooltipBee.style("visibility", "visible")
                })
            .on("mousemove", function() {
                return tooltipBee.style("top", (d3.event.pageY-10)+"px").style("left",(d3.event.pageX+10)+"px");
            })
            .on("mouseout", function(d){
                return tooltipBee.style("visibility", "hidden");
            });